{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[UNK]": 0,
      "#": 1,
      "%": 2,
      "(": 3,
      ")": 4,
      "*": 5,
      "+": 6,
      "-": 7,
      ".": 8,
      "/": 9,
      "0": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "8": 18,
      "9": 19,
      "=": 20,
      "@": 21,
      "A": 22,
      "B": 23,
      "C": 24,
      "D": 25,
      "E": 26,
      "F": 27,
      "G": 28,
      "H": 29,
      "I": 30,
      "K": 31,
      "L": 32,
      "M": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "R": 37,
      "S": 38,
      "T": 39,
      "U": 40,
      "V": 41,
      "W": 42,
      "X": 43,
      "Y": 44,
      "Z": 45,
      "[": 46,
      "\\": 47,
      "]": 48,
      "a": 49,
      "b": 50,
      "c": 51,
      "d": 52,
      "e": 53,
      "f": 54,
      "g": 55,
      "h": 56,
      "i": 57,
      "k": 58,
      "l": 59,
      "m": 60,
      "n": 61,
      "o": 62,
      "p": 63,
      "r": 64,
      "s": 65,
      "t": 66,
      "u": 67,
      "y": 68,
      "cc": 69,
      "CC": 70,
      "c1": 71,
      "(=": 72,
      "ccc": 73,
      "c2": 74,
      "CCCC": 75,
      "OC": 76,
      "NC": 77,
      "c1cc": 78,
      "c3": 79,
      "c1ccc": 80,
      "CCC": 81,
      "](": 82,
      "ccccc": 83,
      ")(": 84,
      "cc1": 85,
      "@@": 86,
      ")[": 87,
      "(-": 88,
      "C1": 89,
      "c1cccc": 90,
      "Cl": 91,
      "CO": 92,
      "nc": 93,
      "CC1": 94,
      "CN": 95,
      "c2ccc": 96,
      "C2": 97,
      "n1": 98,
      "CCN": 99,
      "ccccc2": 100,
      "cc2": 101,
      "c1ccccc1": 102,
      "c4": 103,
      "c2ccccc2": 104,
      "c2cc": 105,
      ")(=": 106,
      ")=": 107,
      "n2": 108,
      "-]": 109,
      "CCO": 110,
      "N1": 111,
      "CC2": 112,
      "c1c": 113,
      "nH": 114,
      "ccccc3": 115,
      "c3ccc": 116,
      "Br": 117,
      "c3ccccc3": 118,
      "CCCCCCCC": 119,
      "cc3": 120,
      "Cc1ccc": 121,
      "N2": 122,
      "COC": 123,
      "([": 124,
      "+]": 125,
      "C3": 126,
      "c2c": 127,
      "c1n": 128,
      "c5": 129,
      "ccc1": 130,
      "c3cc": 131,
      "-])": 132,
      "CNC": 133,
      ".[": 134,
      "OCC": 135,
      "1C": 136,
      "COc1ccc": 137,
      "CCOC": 138,
      "Cc1cc": 139,
      "CC3": 140,
      "ccccc4": 141,
      "n3": 142,
      "CS": 143,
      "nc1": 144,
      "c2cccc": 145,
      "c2n": 146,
      "c1nc": 147,
      "+](=": 148,
      "2c": 149,
      "nc2": 150,
      "ccc2": 151,
      "c4ccccc4": 152,
      "NCC": 153,
      "c3c": 154,
      "CCCN": 155,
      "s1": 156,
      "cc4": 157,
      "CCNC": 158,
      "c4ccc": 159,
      "(/": 160,
      "c6": 161,
      "2C": 162,
      "Cc1ccccc1": 163,
      "Nc1ccc": 164,
      "c1C": 165,
      "CCC1": 166,
      "Cc1c": 167,
      "NC1": 168,
      "N3": 169,
      "@]": 170,
      "@@]": 171,
      "c2nc": 172,
      "nn": 173,
      "+](": 174,
      "2H": 175,
      "C4": 176,
      "sc": 177,
      "o1": 178,
      "CN1": 179,
      "Si": 180,
      "COc1cc": 181,
      "ccccc5": 182,
      ")/": 183,
      "ncc": 184,
      "Cc1cccc": 185,
      "cc1C": 186,
      "cccc": 187,
      "n1c": 188,
      "CCCO": 189,
      "c2ccc3": 190,
      "CCCC1": 191,
      "CCCCC1": 192,
      "nc3": 193,
      "c3cccc": 194,
      "CCC2": 195,
      "s2": 196,
      "c5ccccc5": 197,
      "ccc3": 198,
      "CCS": 199,
      "CCCCC": 200,
      "N1C": 201,
      "Cc1n": 202,
      "CCCC2": 203,
      "c2c1": 204,
      "NS": 205,
      "c1ccc2c": 206,
      "NC2": 207,
      "SC": 208,
      "ccc12": 209,
      "1O": 210,
      "Cc2ccccc2": 211,
      "oc": 212,
      "CC4": 213,
      "N1CCC": 214,
      "Nc2ccc": 215,
      "Cc2ccc": 216,
      "].[": 217,
      "CCCCC2": 218,
      "N1CCN": 219,
      "o2": 220,
      "cn1": 221,
      "N2C": 222,
      "n4": 223,
      "3C": 224,
      "O1": 225,
      "OC1": 226,
      "cc1Cl": 227,
      "CCN1": 228,
      "n2c": 229,
      "C1C": 230,
      "ccccc6": 231,
      "O2": 232,
      "CCCCCCCCCCCCCCCC": 233,
      "CN2": 234,
      "c7": 235,
      "nc4": 236,
      "c1ncc": 237,
      "CCCNC": 238,
      "n1cc": 239,
      "c2ccccc21": 240,
      "c4cc": 241,
      "CCOCCO": 242,
      "CCCCCC": 243,
      "])": 244,
      "cccc2": 245,
      "cc1OC": 246,
      "c3ccc4": 247,
      "c2ccc3c": 248,
      "=[": 249,
      "c1ccc2": 250,
      "1CC": 251,
      "NN": 252,
      "COc1cccc": 253,
      "c5ccc": 254,
      "N2CCN": 255,
      "c6ccccc6": 256,
      "Nc1cc": 257,
      "2O": 258,
      "CCOc1ccc": 259,
      "nn1": 260,
      "c4c": 261,
      "N2CCC": 262,
      "N1CC": 263,
      "cc1F": 264,
      "NCCC": 265,
      "Cc1nc": 266,
      "c2C": 267,
      "NH": 268,
      "CN1C": 269,
      "c4cccc": 270,
      "Oc1ccc": 271,
      "Nc1cccc": 272,
      "-].[": 273,
      "+]([": 274,
      "c1cn": 275,
      "(\\": 276,
      "2CC": 277,
      "OCCO": 278,
      "C2C": 279,
      "C1CC1": 280,
      "c2cc3": 281,
      ")([": 282,
      "CCCCCCC": 283,
      "CCOCC1": 284,
      "CCc1ccc": 285,
      "COc1ccccc1": 286,
      "c3nc": 287,
      "cc21": 288,
      "c12": 289,
      "c2ccccc12": 290,
      "cc5": 291,
      "CCOCC2": 292,
      "N4": 293,
      "C1CCC": 294,
      "C2CC2": 295,
      "CCCC3": 296,
      "ccccc23": 297,
      "Nc1ccccc1": 298,
      "c2ncc": 299,
      "NCC1": 300,
      "SCC": 301,
      "C5": 302,
      "CCC3": 303,
      "c1OC": 304,
      "ncc2": 305,
      "nn2": 306,
      "c1nnc": 307,
      "cc12": 308,
      "OC2": 309,
      "COP": 310,
      "ccc4": 311,
      "c1O": 312,
      "cn2": 313,
      "NCc1ccc": 314,
      "c1cnc": 315,
      "Cn1": 316,
      "COCC": 317,
      "Nc2cc": 318,
      "Cn1c": 319,
      "ccccc7": 320,
      "C1CC": 321,
      "ccc21": 322,
      "s3": 323,
      "2cc": 324,
      "O3": 325,
      "c3ccccc32": 326,
      "C1CCN": 327,
      "1CCC": 328,
      "CCCCC3": 329,
      "CCCCN": 330,
      "CCN1C": 331,
      "12": 332,
      "Oc2ccc": 333,
      "n2cc": 334,
      "Nc3ccc": 335,
      "NNC": 336,
      "c3c2": 337,
      "3CC": 338,
      "ncc1": 339,
      "c1F": 340,
      "Nc2ccccc2": 341,
      "N2CC": 342,
      "c3ccc4c": 343,
      "c2cn": 344,
      "c2nnc": 345,
      "c4ccc5": 346,
      "OCCC": 347,
      "Cc3ccccc3": 348,
      "OCc1ccccc1": 349,
      "Cc1": 350,
      "cc2C": 351,
      "]([": 352,
      "Cc3ccc": 353,
      "CH": 354,
      "ccc1C": 355,
      "CC1C": 356,
      ")-": 357,
      "@@](": 358,
      "1OC": 359,
      "c8": 360,
      "n5": 361,
      "Cc2cc": 362,
      "Nc1nc": 363,
      "o3": 364,
      "nc12": 365,
      "c1ccccc1C": 366,
      "C1CCCCC1": 367,
      "OCc2ccccc2": 368,
      "CCl": 369,
      "NC3": 370,
      "1CN": 371,
      "CN1CCN": 372,
      "cs1": 373,
      "sc1": 374,
      "@](": 375,
      "c3n": 376,
      "4C": 377,
      "CCn1c": 378,
      "3O": 379,
      "c2cnc": 380,
      "c7ccccc7": 381,
      "Cn1cc": 382,
      "c2cccc3": 383,
      "#[": 384,
      "c2ccccn2": 385,
      "c1cc2": 386,
      "NCCN": 387,
      "CCOCC3": 388,
      "C2CCC": 389,
      "n1C": 390,
      "c1Cl": 391,
      "no1": 392,
      "Nc1c": 393,
      "CC1CCC": 394,
      "OCCCC": 395,
      "+].[": 396,
      "cc2Cl": 397,
      "cccc1": 398,
      "CCOc1cc": 399,
      "n2C": 400,
      "CCc1cc": 401,
      "CC5": 402,
      "Nc2cccc": 403,
      "c6ccc": 404,
      "Cc1ccc2c": 405,
      "c23": 406,
      "Na": 407,
      "c2ccccc2C": 408,
      "c2cccnc2": 409,
      "OP": 410,
      "2CCC": 411,
      "c3ccccc23": 412,
      "nc1C": 413,
      "N2CCOCC2": 414,
      "cccc3": 415,
      "NO": 416,
      "c2s": 417,
      "CCC4": 418,
      "N1CCCC": 419,
      "CCCCCCCCCCCC": 420,
      "c3cccc4": 421,
      "c1nn": 422,
      "cc6": 423,
      "Cc2c": 424,
      "ccccc34": 425,
      "])([": 426,
      "CCCCCCCCC": 427,
      "CCc1ccccc1": 428,
      "N3CCN": 429,
      "NCC2": 430,
      "c2cccs2": 431,
      "c1cccs1": 432,
      "-]#[": 433,
      "nc5": 434,
      "C1O": 435,
      "CN2C": 436,
      "nc2c1": 437,
      "CC1CC": 438,
      "Cc1nn": 439,
      "COC1": 440,
      "S1": 441,
      "c21": 442,
      "C3CC3": 443,
      "c3ncc": 444,
      "ccc1OC": 445,
      "NCCCC": 446,
      "c1cccc2": 447,
      "OCCN": 448,
      "c1N": 449,
      "cc1Br": 450,
      "cc2F": 451,
      "c2n1": 452,
      "N2CCCC2": 453,
      "c3cc4": 454,
      "COc1c": 455,
      "ncc3": 456,
      "nn3": 457,
      "Cc1cnc": 458,
      "C2CC": 459,
      "c2cc3c": 460,
      "c1ccccn1": 461,
      "cc2c1": 462,
      "c5cccc": 463,
      "N1CCCC1": 464,
      "ccc2c1": 465,
      "C2CCCCC2": 466,
      "c1cccnc1": 467,
      "c1cc2c": 468,
      "c1csc": 469,
      "c1nc2ccccc2": 470,
      "n3c": 471,
      "n2nc": 472,
      "CN3": 473,
      "ccc1Cl": 474,
      "OCC1": 475,
      "CNCC": 476,
      "Nc2nc": 477,
      "HH": 478,
      "CN1CCC": 479,
      "CCOC1": 480,
      "c5c": 481,
      "C2CCN": 482,
      "c2nc3ccccc3": 483,
      "ccn1": 484,
      "C3C": 485,
      "N1CCOCC1": 486,
      "COc2ccc": 487,
      "cc1NC": 488,
      "OC3": 489,
      "CCCS": 490,
      "c3C": 491,
      "Cc1ccc2": 492,
      "ccc1O": 493,
      "CCCCCCCCCC": 494,
      "c1s": 495,
      "ccc1F": 496,
      "N3C": 497,
      "][": 498,
      "Nc1n": 499,
      "CC1CN": 500,
      "Cc2cccc": 501,
      "C12": 502,
      "Oc1ccccc1": 503,
      "CCn1": 504,
      "OS": 505,
      "c3ccccn3": 506,
      "c5ccc6": 507,
      "nc2c": 508,
      "ccccc8": 509,
      "c3nc4": 510,
      "CNC1": 511,
      "c5cc": 512,
      "ccc5": 513,
      "c4c3": 514,
      "N2CCCC": 515,
      "CCCO1": 516,
      "NCc2ccc": 517,
      "nnc1": 518,
      "-].": 519,
      "c2ccncc2": 520,
      "C1CCCC1": 521,
      "nc21": 522,
      "CSC": 523,
      "OCO2": 524,
      "CCCO2": 525,
      "CNS": 526,
      "COc1ccc2c": 527,
      "cc23": 528,
      "c1cncc": 529,
      "N2CCCCC2": 530,
      "2OC": 531,
      "ccc32": 532,
      "CC1CCN": 533,
      "Nc2c": 534,
      "O4": 535,
      "10": 536,
      "cc32": 537,
      "c1ccnc": 538,
      "C6": 539,
      "NCCO": 540,
      "CCCCNC": 541,
      "Nc3ccccc3": 542,
      "-])[": 543,
      "c2F": 544,
      "NCc1ccccc1": 545,
      "nc32": 546,
      "c4ccc5c": 547,
      "21": 548,
      "CCCCCCCCCCC": 549,
      "cc1O": 550,
      "Oc2ccccc2": 551,
      "nc3c": 552,
      "OCc3ccccc3": 553,
      "FC": 554,
      "CBr": 555,
      "N3CCC": 556,
      "ccccc2c1": 557,
      "c1ccco1": 558,
      "cc1N": 559,
      "CC3CC": 560,
      "COCCN": 561,
      "CC2C": 562,
      "sc2": 563,
      "cn3": 564,
      "CN1CC": 565,
      "c1ccncc1": 566,
      "no2": 567,
      "N1CCCCC1": 568,
      "sc2c1": 569,
      "CCOCCOCCOCCO": 570,
      "N3CCOCC3": 571,
      "ncn2": 572,
      "c4cccc5": 573,
      "OCC2": 574,
      "c1ccccc1Cl": 575,
      "OCO3": 576,
      "C1CN": 577,
      "c2csc": 578,
      "ccc2C": 579,
      "c2ccco2": 580,
      "C1CCCC": 581,
      "c4ccccc43": 582,
      "n2ccc": 583,
      "CCCC4": 584,
      "CCCCO": 585,
      "ncn1": 586,
      "OCCO2": 587,
      "cs2": 588,
      "Oc3ccc": 589,
      "n6": 590,
      "2ccccc12": 591,
      "c2ccccc2Cl": 592,
      "2C1": 593,
      "c2ccccc2C1": 594,
      "c9": 595,
      "c1ccccc1F": 596,
      "CN2CCN": 597,
      "])[": 598,
      "cc1S": 599,
      "c2ccccc2F": 600,
      "cc3C": 601,
      "1CCCC": 602,
      "c1cnn": 603,
      "nnc": 604,
      "NC1CCN": 605,
      "CCN1CCN": 606,
      "CO1": 607,
      "c2nn": 608,
      "sc1C": 609,
      "cc2c": 610,
      "c1sc": 611,
      "12C": 612,
      "C1N": 613,
      "n2c3ccccc3": 614,
      "c4ccccc34": 615,
      "c1NC": 616,
      "/[": 617,
      "CCCOc1ccc": 618,
      "CCOCC": 619,
      "c2sc": 620,
      "CC1CC1": 621,
      "c34": 622,
      "N5": 623,
      "c2ccc3ccccc3": 624,
      "Nc1ccc2c": 625,
      "n3cc": 626,
      "COc1ccc2": 627,
      "c8ccccc8": 628,
      "Cc1cn": 629,
      "CCNC1": 630,
      "Nc3cc": 631,
      "CCN2": 632,
      "Cc1csc": 633,
      "oc1": 634,
      "CCO1": 635,
      "CCCOC": 636,
      "CNC2": 637,
      "c4nc": 638,
      "CCc1c": 639,
      "Cn2c": 640,
      "c1ccn": 641,
      "c2nccc": 642,
      "C1NC": 643,
      "c3ccccc3C": 644,
      "c3cccnc3": 645,
      "4O": 646,
      "CO2": 647,
      "nc23": 648,
      "n3c4ccccc4": 649,
      "C2CCCC2": 650,
      "c1nc2c": 651,
      "Oc2cc": 652,
      "Cc1noc": 653,
      "ccc23": 654,
      "c2noc": 655,
      "CCOC2": 656,
      "c3cnc": 657,
      "Oc1cc": 658,
      "c32": 659,
      "c5c4": 660,
      "CCOc1ccccc1": 661,
      "C2O": 662,
      "c3cccs3": 663,
      "C3CC": 664,
      "CCn1cc": 665,
      "CCCCC4": 666,
      "COc1cc2c": 667,
      "Cc1ncc": 668,
      "COCCC": 669,
      "4CC": 670,
      "cn": 671,
      "CC1CCCC": 672,
      "Nc1ncc": 673,
      "1CCN": 674,
      "CCc1cccc": 675,
      "+]=[": 676,
      "c1Br": 677,
      "c2o": 678,
      "CSCC": 679,
      "S2": 680,
      "CCOCC4": 681,
      "Ir": 682,
      "ccccc45": 683,
      "on1": 684,
      "5C": 685,
      "NH2": 686,
      "c3ccncc3": 687,
      "1NC": 688,
      "cccc1Cl": 689,
      "Oc1cccc": 690,
      "NCc1cccc": 691,
      "CCCCCCCCCCCCC": 692,
      "C3CCC": 693,
      "no": 694,
      "1c1ccc": 695,
      "c2cnn": 696,
      "N3CC": 697,
      "23": 698,
      "N3CCCC3": 699,
      "OO": 700,
      "CN2CCC": 701,
      "Cc1cc2c": 702,
      "NC1CCC": 703,
      "nc2n1": 704,
      "c2nc3c": 705,
      "nn1C": 706,
      "c3ccccc3C2": 707,
      "cc3c2": 708,
      "SC1": 709,
      "OCCOC": 710,
      "NC1CCCCC1": 711,
      "c2Cl": 712,
      "2CN": 713,
      "Cc1cc2": 714,
      "Cc1ccccc1C": 715,
      "21C": 716,
      "Nc3cccc": 717,
      "c1noc": 718,
      "1CO": 719,
      "c2ccccc2c1": 720,
      "CF": 721,
      "c1ccc2nc": 722,
      "c4cc5": 723,
      "C1OC": 724,
      "c2ncccc2": 725,
      "cc7": 726,
      "NC1CC1": 727,
      "CCc1nc": 728,
      "c2ccnc": 729,
      "c7ccc": 730,
      "s4": 731,
      "nc2C": 732,
      "cccc4": 733,
      "c2O": 734,
      "ccc1Br": 735,
      "NCCNC": 736,
      "C3CCCCC3": 737,
      "CSc1ccc": 738,
      "C1CC2": 739,
      "c3n2": 740,
      "1CCCN": 741,
      "OCc2ccc": 742,
      "n12": 743,
      "N1CCC2": 744,
      "CCO2": 745,
      "c1ccc2ccccc2c1": 746,
      "n1nc": 747,
      "Cc4ccccc4": 748,
      "ccn2": 749,
      "nc2cc": 750,
      "2CCCC": 751,
      "Cn1nc": 752,
      "CCSC": 753,
      "Fc1ccc": 754,
      "cc3F": 755,
      "cc3Cl": 756,
      "ccc1N": 757,
      "c2c1C": 758,
      "CCCCCCCCCCCCCC": 759,
      "Pt": 760,
      "c2ccc3ccccc3c2": 761,
      "2CCN": 762,
      "n4c5ccccc5": 763,
      "c6cccc": 764,
      "CCCCOC": 765,
      "Nc4ccc": 766,
      "cc2C1": 767,
      "cc3c": 768,
      "c1cc2ccccc2": 769,
      "NC4": 770,
      "NCc1cc": 771,
      "c3s": 772,
      "CCCl": 773,
      "c6ccc7": 774,
      "C1CCCN": 775,
      "c3ccco3": 776,
      "c2cncc": 777,
      "NCCCN": 778,
      "ccc1NC": 779,
      "n3C": 780,
      "CCc2ccccc2": 781,
      "c1o": 782,
      "c3cn": 783,
      "3OC": 784,
      "ccc2Cl": 785,
      "c2C1": 786,
      "SiH": 787,
      "cnc1": 788,
      "c1ccc2cc": 789,
      "Oc1c": 790,
      "OCCO3": 791,
      "c3ccc4ccccc4": 792,
      "c6c": 793,
      "c1nccc": 794,
      "ccc2F": 795,
      "CCOc1cccc": 796,
      "CC1CCCCC1": 797,
      "CCCCCCCCCCCCCCC": 798,
      "-][": 799,
      "c1ccccc1NC": 800,
      "n1ccc": 801,
      "c3cc4c": 802,
      "n2ccnc2": 803,
      "oc2c1": 804,
      "cccc1C": 805,
      "ccc6": 806,
      "Cc4ccc": 807,
      "ccc3c2": 808,
      "CH2": 809,
      "CN2CC": 810,
      "CCNC2": 811,
      "CNc1ccc": 812,
      "C4CC4": 813,
      "c2cc3ccccc3": 814,
      "Cc1nnc": 815,
      "N3CCCCC3": 816,
      "c3nc4ccccc4": 817,
      "CCCN1C": 818,
      "nc3c2": 819,
      "cc1OCC": 820,
      "3C2": 821,
      "c5cccc6": 822,
      "CCN1CCC": 823,
      "11": 824,
      "OB": 825,
      "c3nnc": 826,
      "CP": 827,
      "CC2CC2": 828,
      "Cc3cc": 829,
      "oc2": 830,
      "c5ccccc54": 831,
      "CCCCCC1": 832,
      "NC1CC": 833,
      "CCNS": 834,
      "C4C": 835,
      "c1CC": 836,
      "32": 837,
      "nnn1": 838,
      "CNc1nc": 839,
      "COCCO": 840,
      "OCO4": 841,
      "Oc3ccccc3": 842,
      "CCN2C": 843,
      "CCCCCCCCCCCCCCCCCC": 844,
      "OCc1ccc": 845,
      "CCCO3": 846,
      "nc6": 847,
      "c1cccc2ccccc12": 848,
      "Nc1ccc2": 849,
      "CSc1nnc": 850,
      "C3CCN": 851,
      "nc3cc": 852,
      "13": 853,
      "CCCc1ccc": 854,
      "COC2": 855,
      "1cc": 856,
      "c5ccc6c": 857,
      "1N": 858,
      "-](": 859,
      "c3cnn": 860,
      "C1CCC1": 861,
      "NC2CC2": 862,
      "N1CC2": 863,
      "NC2CCCCC2": 864,
      "NCc2ccccc2": 865,
      "Nc1ccccc1C": 866,
      "nc2ccccc21": 867,
      "COCCNC": 868,
      "C23": 869,
      "CNc1cc": 870,
      "c1nc2ccc": 871,
      "CCCCCCCCCCCCCCCCC": 872,
      "Cn2": 873,
      "CC12": 874,
      "Cc1cccc2": 875,
      "C1CCC2": 876,
      "ccccc9": 877,
      "NCCS": 878,
      "C2CCCC": 879,
      "ccc43": 880,
      "CCC1C": 881,
      "c1ccccc1OC": 882,
      "c1S": 883,
      "cccc21": 884,
      "Cc1cccnc1": 885,
      "CCc2ccc": 886,
      "ccc2n1": 887,
      "C21": 888,
      "N4CCN": 889,
      "cccc2Cl": 890,
      "ncc4": 891,
      "NCCc1ccc": 892,
      "CCOP": 893,
      "c3ccc4ccccc4c3": 894,
      "c3nn": 895,
      "c4ncc": 896,
      "c2cccc3ccccc23": 897,
      "cc2OC": 898,
      "5CC": 899,
      "CCC1CCC": 900,
      "CCCn1c": 901,
      "C1c1ccc": 902,
      "CN4": 903,
      "Nc2ncc": 904,
      "c3ccccc3Cl": 905,
      "c6cc": 906,
      "c3ccccc3F": 907,
      "+]=": 908,
      "NC1C": 909,
      "COc1ccccc1C": 910,
      "CC4CC": 911,
      "c2nc3ccc": 912,
      "Nc2ccc3c": 913,
      "NOC": 914,
      "Cc3cccc": 915,
      "5O": 916,
      "CCN1CC": 917,
      "NC1CCCC1": 918,
      "cccn3": 919,
      "])(": 920,
      "OCC3": 921,
      "C2CN": 922,
      "CCNCC1": 923,
      "c2nnn": 924,
      "c2ccccc2n1": 925,
      "cH": 926,
      "Cc1ccco1": 927,
      "Sc2ccc": 928,
      "1CCCN1C": 929,
      "OC1C": 930,
      "c1cc2cc": 931,
      "ccc2cc": 932,
      "c1ccccc12": 933,
      "NCC3": 934,
      "Cc1cccs1": 935,
      "c2ncn": 936,
      "Cc1ccnc": 937,
      "Cc3c": 938,
      "c3F": 939,
      "C7": 940,
      "c3cccc4ccccc34": 941,
      "c45": 942,
      "\\[": 943,
      "Cn1ccc": 944,
      "1c1ccccc1": 945,
      "nn2C": 946,
      "OCOC": 947,
      "n3nc": 948,
      "CCn1nc": 949,
      "c3ccccc3c2": 950,
      "c1ccsc1": 951,
      "cc2Br": 952,
      "C2CC3": 953,
      "c6c5": 954,
      "N4CCOCC4": 955,
      "N1CCCN": 956,
      "C1CO": 957,
      "Nc2ccccc2C": 958,
      "ccc1OCC": 959,
      "cccc12": 960,
      "c2ccn": 961,
      "3CCC": 962,
      "CC2CCC": 963,
      "nn12": 964,
      "-]=": 965,
      "cc2cc": 966,
      "nc2ccccc12": 967,
      "c4ccccn4": 968,
      "Clc1ccc": 969,
      "C2CCC2": 970,
      "c2ccsc2": 971,
      "n7": 972,
      "n2cnc3c": 973,
      "cc34": 974,
      "1C2": 975,
      "o4": 976,
      "c2c3ccccc3": 977,
      "c3c4ccccc4": 978,
      "OH": 979,
      "n1ccnc1": 980,
      "CCNCC2": 981,
      "COc3ccc": 982,
      "c1OCC": 983,
      "CSc2nnc": 984,
      "n2cccn2": 985,
      "Oc2cccc": 986,
      "nccc": 987,
      "CCCCOc1ccc": 988,
      "7ccccc7": 989,
      "12CC": 990,
      "c43": 991,
      "OC4": 992,
      "cc43": 993,
      "COc1cc2": 994,
      "c4ccccc4C": 995,
      "oc4ccccc4": 996,
      "c4nc5": 997,
      "ccc2OC": 998,
      "2CO": 999,
      "on2": 1000,
      "c3cccc4c3": 1001,
      "OCCNC": 1002,
      "C2C1": 1003,
      "COc1nc": 1004,
      "c2ncccn2": 1005,
      "Nc1nnc": 1006,
      "c1c2c": 1007,
      "sc3": 1008,
      "N2CCC3": 1009,
      "n4c": 1010,
      "c1ccccc1O": 1011,
      "CCCN1": 1012,
      "Nc3nc": 1013,
      "Oc2c": 1014,
      "c5ccccc45": 1015,
      "CCN3": 1016,
      "c2ccc3nc": 1017,
      "nc2ccc": 1018,
      "c4cccc5c4": 1019,
      "3c": 1020,
      "6C": 1021,
      "CO3": 1022,
      "ncc1C": 1023,
      "cc2s1": 1024,
      "NC2CCC": 1025,
      "-])=": 1026,
      "c2ccccc2N": 1027,
      "Li": 1028,
      "nnc2": 1029,
      "OCc4ccccc4": 1030,
      "Cc2nc": 1031,
      "2NC": 1032,
      "c1nc2ccccc2s1": 1033,
      "CCCCCN": 1034,
      "c2ccccc2OC": 1035,
      "CCCN3": 1036,
      "COCC1": 1037,
      "cc2n1": 1038,
      "c5cc6": 1039,
      "OCc3ccc": 1040,
      "ccccc56": 1041,
      "c2c1cc": 1042,
      "N3CCCC": 1043,
      "].": 1044,
      "CCNc1nc": 1045,
      "CCOc1c": 1046,
      "O5": 1047,
      "Oc3cc": 1048,
      "c9ccccc9": 1049,
      "COc1cccc2": 1050,
      "CC6": 1051,
      "c1ccccc1Br": 1052,
      "C3CCCC3": 1053,
      "cccc2C": 1054,
      "Nc3c": 1055,
      "ON": 1056,
      "ccc3C": 1057,
      "cccc1F": 1058,
      "N1c1ccc": 1059,
      "c2nc3ccccc3s2": 1060,
      "NCc3ccc": 1061,
      "COS": 1062,
      "Cc1ccc2nc": 1063,
      "n5c6ccccc6": 1064,
      "NCCC1": 1065,
      "Cn2cc": 1066,
      "COc2ccccc2": 1067,
      "CCCc1cc": 1068,
      "NH3": 1069,
      "CCCCS": 1070,
      "oc5ccccc5": 1071,
      "N1CCNCC1": 1072,
      "c2nc3cc": 1073,
      "CCCCCNC": 1074,
      "ncnc32": 1075,
      "nc1N": 1076,
      "nc4c": 1077,
      "c3ccccc34": 1078,
      "CCC5": 1079,
      "Sn": 1080,
      "C1C2": 1081,
      "CON": 1082,
      "oc2cc": 1083,
      "c4cccnc4": 1084,
      "c2c3c": 1085,
      "N2CCNCC2": 1086,
      "CCNCC": 1087,
      "Cc1ccccc1Cl": 1088,
      "2N": 1089,
      "c1nc2cc": 1090,
      "](/": 1091,
      "c2ccc3cc": 1092,
      "cnc2": 1093,
      "c2ccccc23": 1094,
      "2CCCN": 1095,
      "cc3C2": 1096,
      "c4ccc5ccccc5": 1097,
      "1ccccc1": 1098,
      "n2CC": 1099,
      "3H": 1100,
      "CCOC3": 1101,
      "C1CCNCC1": 1102,
      "CSCCC": 1103,
      ")\\": 1104,
      "(=[": 1105,
      "c3C2": 1106,
      "1CCCO1": 1107,
      "N2CCCN": 1108,
      "6O": 1109,
      "CCC1C2": 1110,
      "NCCN1": 1111,
      "nc2s": 1112,
      "c4cnc": 1113,
      "CNc2ccc": 1114,
      "c2N": 1115,
      "C2NC": 1116,
      "NC2CCCC2": 1117,
      "n1nn": 1118,
      "n2c1": 1119,
      "CCc1nn": 1120,
      "Sc1ccc": 1121,
      "+])": 1122,
      "C1CCOCC1": 1123,
      "NCCCO": 1124,
      "Cc1o": 1125,
      "c4C": 1126,
      "cnn1": 1127,
      "c2nccs2": 1128,
      "CCC1CC": 1129,
      "CCCCc1ccc": 1130,
      "cn4": 1131,
      "CC1O": 1132,
      "C2N": 1133,
      "43C": 1134,
      "CN1CCCC1": 1135,
      "NC2CCN": 1136,
      "CCCCN1C": 1137,
      "CH3": 1138,
      "CCCCCCCCCCCCCCCCCCC": 1139,
      "CN3C": 1140,
      "N4C": 1141,
      "CCCCCC2": 1142,
      "c2cc3cc": 1143,
      "SC2": 1144,
      "OCCCO": 1145,
      "Cc1nc2c": 1146,
      "CC3C": 1147,
      "cc2N": 1148,
      "Cc1ccccc1F": 1149,
      "CCC1CN": 1150,
      "oc1C": 1151,
      "Nc1nc2c": 1152,
      "n1CC": 1153,
      "Se": 1154,
      "c6ccccc65": 1155,
      "nc2nc": 1156,
      "CNCCC": 1157,
      "c4ccccc4C3": 1158,
      "c3cc4ccccc4": 1159,
      "cc4c3": 1160,
      "ncn3": 1161,
      "C1CCS": 1162,
      "SCCC": 1163,
      "Cn1ccnc1": 1164,
      "2C3": 1165,
      "c3csc": 1166,
      "Cc1ccsc1": 1167,
      "C12CC3CC": 1168,
      "c3cncc": 1169,
      "CC1CCCN": 1170,
      "c5nc": 1171,
      "COC1OC": 1172,
      "C4CCC": 1173,
      "C1CCOC1": 1174,
      "no3": 1175,
      "c1cnc2c": 1176,
      "NCc2cccc": 1177,
      "COc1ncc": 1178,
      "c3sc": 1179,
      "CSc1nc": 1180,
      "CNCC2": 1181,
      "CCOCCOCCO": 1182,
      "ccc4c3": 1183,
      "ccc34": 1184,
      "c4ccc5ccccc5c4": 1185,
      "C4CC": 1186,
      "Cc2ccco2": 1187,
      "c1nccs1": 1188,
      "ccc2O": 1189,
      "n2n1": 1190,
      "CN1CCCC": 1191,
      "COc2cc": 1192,
      "nc3ccccc23": 1193,
      "c1cccc2c1": 1194,
      "c6cccc7": 1195,
      "-])(": 1196,
      "c2ccccc2O": 1197,
      "-]=[": 1198,
      "Cc1ccccn1": 1199,
      "N1S": 1200,
      "3CCCC": 1201,
      "n4cc": 1202,
      "c1c2ccccc2": 1203,
      "cc4C": 1204,
      "nc3ccc": 1205,
      "nc2c1nc": 1206,
      "cc8": 1207,
      "ccc13": 1208,
      "NCc2cc": 1209,
      "23C": 1210,
      "nc1Cl": 1211,
      "CSC1": 1212,
      "c2ncnc": 1213,
      "C3O": 1214,
      "CN2CCCC2": 1215,
      "sc2n1": 1216,
      "c2cccc3c2": 1217,
      "Cc1s": 1218,
      "c54": 1219,
      "n23": 1220,
      "C2OC": 1221,
      "NCCCCC": 1222,
      "Cc1sc": 1223,
      "Cc1ccncc1": 1224,
      "Zr": 1225,
      "nn23": 1226,
      "ccc2c": 1227,
      "Cc2ccc3c": 1228,
      "c8ccc": 1229,
      "cc2O": 1230,
      "cnc": 1231,
      "1COC": 1232,
      "CN3CCN": 1233,
      "cccc5": 1234,
      "c2sccc2": 1235,
      "N4CCC": 1236,
      "oc12": 1237,
      "CCc3ccccc3": 1238,
      "CCCc1nc": 1239,
      "CCBr": 1240,
      "OC1CC": 1241,
      "Fe": 1242,
      "oc3": 1243,
      "SS": 1244,
      "c3ccccc3n2": 1245,
      "CC1CCCC1": 1246,
      "c1ccccc1N": 1247,
      "N2CC3": 1248,
      "2CCCO2": 1249,
      "CC2CC": 1250,
      "N1CCCC1C": 1251,
      "n3ccnc3": 1252,
      "COCCOC": 1253,
      "n2nn": 1254,
      "nc3ccccc32": 1255,
      "nc43": 1256,
      "oc6ccccc6": 1257,
      "ccn3": 1258,
      "c4ccncc4": 1259,
      "Cc1cnn": 1260,
      "c2c3ccccc3c": 1261,
      "CCO3": 1262,
      "c1coc": 1263,
      "c3ccnc": 1264,
      "cc4c": 1265,
      "Fc1cc": 1266,
      "2CCCN2C": 1267,
      "c3Cl": 1268,
      "c3c4ccccc4c": 1269,
      "Oc1ccc2c": 1270,
      "n2c3ccccc3c3cc": 1271,
      "Oc4ccc": 1272,
      "OCCCN": 1273,
      "ccc1S": 1274,
      "CNC3": 1275,
      "Cc2cccs2": 1276,
      "COc1ccccc1NC": 1277,
      "NCCC2": 1278,
      "CSc1n": 1279,
      "COc2cccc": 1280,
      "2c2ccc": 1281,
      "cc1CN": 1282,
      "CI": 1283,
      "nc34": 1284,
      "ccc3c": 1285,
      "c7ccc8": 1286,
      "COCc1ccccc1": 1287,
      "CN2CCOCC2": 1288,
      "OCCO4": 1289,
      "CC2CCCCC2": 1290,
      "c4cc5c": 1291,
      "4c": 1292,
      "CCCCO1": 1293,
      "c6ccc7c": 1294,
      "Nc2n": 1295,
      "c7cccc": 1296,
      "N1CCOC": 1297,
      "Cn2nc": 1298,
      "CNCc1ccc": 1299,
      "cc3s2": 1300,
      "CCCCCCCCCCCCCCCCCCCCC": 1301,
      "c4cccc5ccccc45": 1302,
      "Nc1cccc2": 1303,
      "c4c5ccccc5": 1304,
      "CCNc1cc": 1305,
      "CCNC3": 1306,
      "cccc2F": 1307,
      "NCc3ccccc3": 1308,
      "NCCOC": 1309,
      "Cc1oc": 1310,
      "C2c2ccc": 1311,
      "34": 1312,
      "cccc2c1": 1313,
      "3CCN": 1314,
      "CCCCCCCCCCCCCCCCCCCC": 1315,
      "CC1CCCO1": 1316,
      "nc3n2": 1317,
      "ccc2ccccc12": 1318,
      "NP": 1319,
      "N2CCCCCC2": 1320,
      "c2ccccc2O1": 1321,
      "N1CCS": 1322,
      "c1CN": 1323,
      "cc1CC": 1324,
      "Cc2cccnc2": 1325,
      "2CC3CC": 1326,
      "C2CCCN": 1327,
      "c4n": 1328,
      "NC2CC": 1329,
      "Cc2cnc": 1330,
      "N12": 1331,
      "c1ncn": 1332,
      "cc3ccccc23": 1333,
      "c2sc3c": 1334,
      "S3": 1335,
      "ccccc2n1": 1336,
      "CCCCCCN": 1337,
      "n4c5ccccc5c5ccccc54": 1338,
      "cccnc12": 1339,
      "NC3CC3": 1340,
      "C2C3": 1341,
      "cc3n2": 1342,
      "1CCCN1": 1343,
      "Nc2nnc": 1344,
      "Cc1cncc": 1345,
      "n2ncc": 1346,
      "CCCC5": 1347,
      "nc3nc": 1348,
      "nn4": 1349,
      "nc2c1ncn2": 1350,
      "nc3C": 1351,
      "CN1CCCCC1": 1352,
      "C1CCCN1": 1353,
      "C1CCCN1C": 1354,
      "CCCc1c": 1355,
      "OCCCCCCCC": 1356,
      "ccc3n2": 1357,
      "CC1CC2": 1358,
      "N2C1": 1359,
      "NCCc2ccc": 1360,
      "CCOc2ccc": 1361,
      "CCc1n": 1362,
      "NCC1CCN": 1363,
      "N4CCCC4": 1364,
      "CC3CC3": 1365,
      "Cc1ccccc1NC": 1366,
      "COCc2ccccc2": 1367,
      "Sc1nnc": 1368,
      "c5cccc6c5": 1369,
      "C32": 1370,
      "Sc2ccccc2": 1371,
      "Cu": 1372,
      "NCCOCCO": 1373,
      "CN1CCOCC1": 1374,
      "ccc7": 1375,
      "ccc2o1": 1376,
      "c1cnccn1": 1377,
      "Zn": 1378,
      "c3O": 1379,
      "C2CCNCC2": 1380,
      "N1CCCCCC1": 1381,
      "Al": 1382,
      "CCCCn1c": 1383,
      "c1I": 1384,
      "+]#[": 1385,
      "c56": 1386,
      "OC2C": 1387,
      "cs3": 1388,
      "13C": 1389,
      "n3n2": 1390,
      "n2cccc2": 1391,
      "cccc3Cl": 1392,
      "CCCC1CCC": 1393,
      "c1ccoc1": 1394,
      "Fc1cccc": 1395,
      "Cc2ccccc2Cl": 1396,
      "CCOCC5": 1397,
      "n3c4ccccc4c4ccccc43": 1398,
      "Nc4cc": 1399,
      "NCc1c": 1400,
      "c1ccccc1S": 1401,
      "CC1N": 1402,
      "n1ncc": 1403,
      "CCOCCOCCOCCOCCOCCOCCOCCO": 1404,
      "1CCC2": 1405,
      "C4CCCCC4": 1406,
      "Oc4ccccc4": 1407,
      "3CCCN": 1408,
      "NCc1ccco1": 1409,
      "OCC1c2ccccc2": 1410,
      "NCC1CCC": 1411,
      "CCCn1cc": 1412,
      "Pd": 1413,
      "c3ncccn3": 1414,
      "1CCS": 1415,
      "COC3": 1416,
      "OCCCCCC": 1417,
      "Cn1nn": 1418,
      "C1S": 1419,
      "ncnc21": 1420,
      "CC21": 1421,
      "PH": 1422,
      "NC1CCCC": 1423,
      "Nc4ccccc4": 1424,
      "c2cc1OC": 1425,
      "CCCNc1nc": 1426,
      "C2CCOCC2": 1427,
      "C1CS": 1428,
      "Nc1cn": 1429,
      "Cc2ccccc21": 1430,
      "N1N": 1431,
      "CCc2cc": 1432,
      "c5ccc6ccccc6": 1433,
      "CC1CCC1": 1434,
      "Cc1nc2ccccc2": 1435,
      "2CCOCC2": 1436,
      "c1CCC": 1437,
      "c2OC": 1438,
      "c6nc": 1439,
      "sc5ccccc5": 1440,
      "nn3C": 1441,
      ")=[": 1442,
      "C1c1ccccc1": 1443,
      "-])([": 1444,
      "cc3OC": 1445,
      "C2SC": 1446,
      "Sc1ccccc1": 1447,
      "c1cs": 1448,
      "cccc32": 1449,
      "43": 1450,
      "sc12": 1451,
      "c4cccs4": 1452,
      "c1oc": 1453,
      "CCC1CCCC": 1454,
      "Ti": 1455,
      "C3C2": 1456,
      "c2cs": 1457,
      "Nc3ncc": 1458,
      "CS1": 1459,
      "n2c3ccccc3c3ccccc32": 1460,
      "Cc2ccccn2": 1461,
      "cnn1C": 1462,
      "n3ccc": 1463,
      "Cc2ccccc2F": 1464,
      "CCCCC5": 1465,
      "c1nc2ccccc2c": 1466,
      "nc4ccccc4": 1467,
      "OCCCCC": 1468,
      "c4cn": 1469,
      "c1OCc1ccc": 1470,
      "c2ccccc2Br": 1471,
      "4OC": 1472,
      "NCCc1ccccc1": 1473,
      "cnn2": 1474,
      "CCc3ccc": 1475,
      "CCN1CCCC1": 1476,
      "OC1CCC": 1477,
      "NCc1nc": 1478,
      "COCCCNC": 1479,
      "CC1OC": 1480,
      "cc4F": 1481,
      "COc1ccc2cc": 1482,
      "CNC2CC2": 1483,
      "CCCOc1cc": 1484,
      "c1ncccc1": 1485,
      "1CC2": 1486,
      "cc3cc": 1487,
      "c2ccc3ncc": 1488,
      "6CC": 1489,
      "c4ccccc4n5": 1490,
      "N4CC": 1491,
      "c2oc": 1492,
      "CN2CCCCC2": 1493,
      "N1CCc2c": 1494,
      "CCCc1ccccc1": 1495,
      "oc3cc": 1496,
      "nc2s1": 1497,
      "OCCCO2": 1498,
      "CCc1nnc": 1499,
      "Cc1nc2ccc": 1500,
      "COc3ccccc3": 1501,
      "COCCCC": 1502,
      "3CN": 1503,
      "oc3ccccc34": 1504,
      "cn12": 1505,
      "ccc2N": 1506,
      "CNc2cc": 1507,
      "sc2cc": 1508,
      "OC1CCCC1": 1509,
      "n1Cc1ccc": 1510,
      "Cc1ccn": 1511,
      "oc2ccccc12": 1512,
      "OCc2cccc": 1513,
      "c4cnn": 1514,
      "CCCN2": 1515,
      "nc3s": 1516,
      "n1cccn1": 1517,
      "CCCCO2": 1518,
      "c4n3": 1519,
      "c3ccccc3O": 1520,
      "OCc1cc": 1521,
      "CC1C3": 1522,
      "Cn1ncc": 1523,
      "c5ccc6ccccc6c5": 1524,
      "Cc2csc": 1525,
      "COc1ccc2nc": 1526,
      "1c": 1527,
      "nc2c1c": 1528,
      "OCCOCCO": 1529,
      "Cn1n": 1530,
      "8ccccc8": 1531,
      "c3noc": 1532,
      "c5c6ccccc6": 1533,
      "c1ccc2ncc": 1534,
      "oc4ccccc45": 1535,
      "c3c4c": 1536,
      "CCN1CCOCC1": 1537,
      "CCC1CCN": 1538,
      "c1ccccc1C2": 1539,
      "n3cccn3": 1540,
      "CSc1cccc": 1541,
      "4CCC": 1542,
      "NC3CCCCC3": 1543,
      "COCCN1C": 1544,
      "n3c4ccccc4c4cc": 1545,
      "ncnc1": 1546,
      "SiH2": 1547,
      "ccc2O1": 1548,
      "Cc2cn": 1549,
      "NN1": 1550,
      "Nc1s": 1551,
      "ccc54": 1552,
      "NCc1cccnc1": 1553,
      "CCc1ccc2c": 1554,
      "OCc2cc": 1555,
      "c2ccccn12": 1556,
      "nc2N": 1557,
      "sc3c2": 1558,
      "1CNC": 1559,
      "c1cccc2c": 1560,
      "nnn2": 1561,
      "OC2OC": 1562,
      "n1c2ccccc2": 1563,
      "Cc2ccccc2C": 1564,
      "CC1C2": 1565,
      "ON1C": 1566,
      "COCCn1c": 1567,
      "c2nnnn2": 1568,
      "nc2sc": 1569,
      "CCNc1ccc": 1570,
      "12CCC": 1571,
      "sc4ccccc4": 1572,
      "Nc1cncc": 1573,
      "c3ccccc3OC": 1574,
      "ccc1OCc1ccccc1": 1575,
      "cc1I": 1576,
      "NC2C": 1577,
      "7O": 1578,
      "Cc1nc2cc": 1579,
      "c2cnccn2": 1580,
      "N4CCCCC4": 1581,
      "CCc2c": 1582,
      "CNCc1cc": 1583,
      "C3CCC3": 1584,
      "ncnc": 1585,
      "N3CCNCC3": 1586,
      "c1nnn": 1587,
      "c7c6": 1588,
      "CN3CCC": 1589,
      "cccc23": 1590,
      "c7c": 1591,
      "CS2": 1592,
      "CCC2C": 1593,
      "Nc3ccc4c": 1594,
      "Cn1cnc": 1595,
      "CN2CCCC": 1596,
      "CCSCC2": 1597,
      "c3nc4c": 1598,
      "NCCCNC": 1599,
      "NCc1ccc2c": 1600,
      "14": 1601,
      "CCc1ncc": 1602,
      "2COC": 1603,
      "n2cncn2": 1604,
      "CCC1CC2": 1605,
      "n1N": 1606,
      "s5": 1607,
      "n1cnc": 1608,
      "c4cc5ccccc5": 1609,
      "C1c2ccccc2C": 1610,
      "n3c2": 1611,
      "CCCCCO": 1612,
      "c3ccc4cc": 1613,
      "cc54": 1614,
      "n6c7ccccc7": 1615,
      "CCC2C3": 1616,
      "N2CCOC": 1617,
      "nc2ccccc2c1": 1618,
      "ccccc67": 1619,
      "CCNCC3": 1620,
      "ccc2C1": 1621,
      "ncc5": 1622,
      "co1": 1623,
      "n5c6ccccc6c6ccccc65": 1624,
      "c3ccccc31": 1625,
      "2O1": 1626,
      "CCN3C": 1627,
      "ncc2c1": 1628,
      "Nc1nccc": 1629,
      "C23CC4CC": 1630,
      "CC1CCCN1": 1631,
      "+][": 1632,
      "1CS": 1633,
      "NCCCCCC": 1634,
      "Nc3ccccc3C": 1635,
      "CCS1": 1636,
      "CCCOc1cccc": 1637,
      "nc4c3": 1638,
      "1ccc": 1639,
      "c7cc": 1640,
      "cc4Cl": 1641,
      "c4nc5ccccc5": 1642,
      "c2cccnc21": 1643,
      "OOC": 1644,
      "3CCC4": 1645,
      "ccc3F": 1646,
      "CC5CC": 1647,
      "c4F": 1648,
      "CCCN2C": 1649,
      "Nc1cnc": 1650,
      "Nc1ccn": 1651,
      "n1Cc1ccccc1": 1652,
      "Brc1ccc": 1653,
      "CCP": 1654,
      "c2cc1C": 1655,
      "COc2c": 1656,
      "Cn3c": 1657,
      "CSC2": 1658,
      "10ccccc": 1659,
      "CC2CCCO2": 1660,
      "C4CCN": 1661,
      "10c": 1662,
      "nc54": 1663,
      "c6cc7": 1664,
      "sc6ccccc6": 1665,
      "C5C": 1666,
      "NCc2ccco2": 1667,
      "CCOC1CC": 1668,
      "c3ccsc3": 1669,
      "C5CC5": 1670,
      "n4C": 1671,
      "ccc3Cl": 1672,
      "Nc2nccc": 1673,
      "C2S": 1674,
      "ccc3ccccc23": 1675,
      "ncc2c": 1676,
      "c4ccco4": 1677,
      "oc2c": 1678,
      "OC1CCCCC1": 1679,
      "B2OC": 1680,
      "N1CCO": 1681,
      "C8": 1682,
      "oc7ccccc7": 1683,
      "n8": 1684,
      "Nc1ccccc1F": 1685,
      "N6": 1686,
      "c13": 1687,
      "CC1NC": 1688,
      "OCCS": 1689,
      "c2ccccc2S": 1690,
      "Nc1ccccc1Cl": 1691,
      "CCCCCOC": 1692,
      "Cc1ccccc1N": 1693,
      "cc45": 1694,
      "c1ncccn1": 1695,
      "c2nccn2C": 1696,
      "c1cc2ccccc2o1": 1697,
      "Cc1ccc2cc": 1698,
      "Cc1ccc2ccccc2c1": 1699,
      "c1ccc2oc": 1700,
      "CC2CN": 1701,
      "c5cccc6ccccc56": 1702,
      "Cc2ccncc2": 1703,
      "B3": 1704,
      "ccc3cc": 1705,
      "CNc2nc": 1706,
      "Mg": 1707,
      "SCc2ccc": 1708,
      "CCCCl": 1709,
      "c3nc4ccc": 1710,
      "CCc1cnc": 1711,
      "CCC12": 1712,
      "sc2C": 1713,
      "12O": 1714,
      "N1CCc2cc": 1715,
      "CCn1ncc": 1716,
      "CCCNC1": 1717,
      "CC2C1": 1718,
      "CNc1cccc": 1719,
      "CCCN1CCC": 1720,
      "OC5": 1721,
      "c1ccccc21": 1722,
      "N1C2": 1723,
      "CCc1cc2c": 1724,
      "CCCOCC": 1725,
      "Cc1cccc2ccccc12": 1726,
      "c4ccccc4n": 1727,
      "1c1cccc": 1728,
      "oc3c": 1729,
      "Oc2ccc3c": 1730,
      "c5ccccc5n6": 1731,
      "c1ncccc1C": 1732,
      "cc2c1C": 1733,
      "3CO": 1734,
      "Oc3c": 1735,
      "CCC1CCCCC1": 1736,
      "c1ccccc1n2": 1737,
      "c65": 1738,
      "CN1CCCN": 1739,
      "Oc1ccccc1C": 1740,
      "c3ccccc3N": 1741,
      "c6ccccc56": 1742,
      "CNCC1": 1743,
      "c3ccccc3n4": 1744,
      "N2c2ccc": 1745,
      "N1c1ccccc1": 1746,
      "ccc1OCc1ccc": 1747,
      "CCSC1": 1748,
      "Co": 1749,
      "cc1CNC": 1750,
      "c3nc4ccccc4s3": 1751,
      "ccccc32": 1752,
      "c1nnnn1": 1753,
      "cnc12": 1754,
      "c1cc2ccc": 1755,
      "Nc1cnn": 1756,
      "cccc3C": 1757,
      "Fc1c": 1758,
      "C34": 1759,
      "CN3CCOCC3": 1760,
      "c3ncnc": 1761,
      "CCc1ccccc1NC": 1762,
      "OCc4ccc": 1763,
      "Ge": 1764,
      "Ru": 1765,
      "Cc2n": 1766,
      "nnc1SCC": 1767,
      "Nc4cccc": 1768,
      "C2CCCN2C": 1769,
      "ccc2Br": 1770,
      "NCCc1c": 1771,
      "C1CCCNC1": 1772,
      "Ni": 1773,
      "CNCCN": 1774,
      "Cc1ncsc1": 1775,
      "2CCCC2": 1776,
      "CSc2ccc": 1777,
      "Cc1nccn1": 1778,
      "NCCN1C": 1779,
      "COCCN1": 1780,
      "nc4ccc": 1781,
      "CCOc1ccccc1NC": 1782,
      "c2ccccc2n3": 1783,
      "C1c2ccccc2": 1784,
      "n2c3ccc": 1785,
      "c2cnc3c": 1786,
      "OCCO1": 1787,
      "Oc3cccc": 1788,
      "c3c2C": 1789,
      "C1Cc2ccccc2": 1790,
      "ccccc21": 1791,
      "n1C1CC1": 1792,
      "CCCC1C": 1793,
      "cccc1NC": 1794,
      "CN1CCC2": 1795,
      "c2nc3ccccc3c": 1796,
      "COCCCN": 1797,
      "oc2ccc": 1798,
      "Nc1cc2c": 1799,
      "n4ccc": 1800,
      "c5nc6": 1801,
      "NC5": 1802,
      "OCO5": 1803,
      "CCSC2": 1804,
      "ccc3OC": 1805,
      "ncc2C": 1806,
      "2CCCN2": 1807,
      "NN2C": 1808,
      "C3CCCC": 1809,
      "c2cc1": 1810,
      "CCCCCCCCCCCCCCCCCCCCCC": 1811,
      "CCOc1ccccc1C": 1812,
      "Cc1cc2cc": 1813,
      "c3o": 1814,
      "nc1CC": 1815,
      "NCc2c": 1816,
      "ccc3C2": 1817,
      "cnc21": 1818,
      "n1cnc2c": 1819,
      "ccc2s1": 1820,
      "nc5c": 1821,
      "c1ncnc": 1822,
      "Cc4cc": 1823,
      "2CNC": 1824,
      "c2s1": 1825,
      "OCC4": 1826,
      "Cc1cs": 1827,
      "CCOCCN": 1828,
      "oc3c2": 1829,
      "cccc3F": 1830,
      "cc2ccccc12": 1831,
      "Nc1cccnc1": 1832,
      "c2ncccc2C": 1833,
      "Cc5ccccc5": 1834,
      "c5ccccc5n": 1835,
      "nc4cc": 1836,
      "C1CCNC1": 1837,
      "cccnc23": 1838,
      "ns": 1839,
      "CC2CCN": 1840,
      "c3c1": 1841,
      "ncc12": 1842,
      "C1c1cccc": 1843,
      "Sc3ccc": 1844,
      "COCc1ccc": 1845,
      "nc3ccccc3c2": 1846,
      "Nc1nc2ccc": 1847,
      "N1Cc1ccccc1": 1848,
      "ccc5c4": 1849,
      "Clc1cc": 1850,
      "c4ccc5c6ccccc6": 1851,
      "OC2CCN": 1852,
      "COCCOCCO": 1853,
      "c3s2": 1854,
      "7C": 1855,
      "n3cnc4c": 1856,
      "n1nnnc1": 1857,
      "cc2NC": 1858,
      "CCNCc1ccc": 1859,
      "Cc3cccnc3": 1860,
      "on3": 1861,
      "c7ccccc76": 1862,
      "3CCCO3": 1863,
      "c1CNC": 1864,
      "cnn3": 1865,
      "c2Br": 1866,
      "CCCCCCO": 1867,
      "c3ncn": 1868,
      "C2CCCN2": 1869,
      "3CCOCC3": 1870,
      "2c2ccccc2": 1871,
      "Oc2nc": 1872,
      "cccc6": 1873,
      "CN5": 1874,
      "COCc1cc": 1875,
      "SOO": 1876,
      "N1CCc2ccccc2C1": 1877,
      "nc2c1C": 1878,
      "c2o1": 1879,
      "CCCNCC": 1880,
      "CNc1ncc": 1881,
      "COC1CC": 1882,
      "Nc2ccc3": 1883,
      "n21": 1884,
      "OC2CC": 1885,
      "Clc1cccc": 1886,
      "Cn1nnc": 1887,
      "cn1C": 1888,
      "CNC1CC1": 1889,
      "1CCCCN1C": 1890,
      "c5ccccn5": 1891,
      "N5CCN": 1892,
      "CCCNS": 1893,
      "oc2C": 1894,
      "34C": 1895,
      "C3CCOCC3": 1896,
      "n1n": 1897,
      "](=": 1898,
      "4C3": 1899,
      "c3ccn": 1900,
      "nc3n": 1901,
      "Cc3ccc4c": 1902,
      "P1": 1903,
      "CC4C": 1904,
      "CCCNC3": 1905,
      "CNc1c": 1906,
      "c5cnc": 1907,
      "c1C2": 1908,
      "CB": 1909,
      "CCCCCOc1ccc": 1910,
      "Cc3ccco3": 1911,
      "c2ccoc2": 1912,
      "cc13": 1913,
      "15": 1914,
      "CSc2nc": 1915,
      "NN2": 1916,
      "C43": 1917,
      "CC2CCCC2": 1918,
      "CSc1ccccc1": 1919,
      "ccccc24": 1920,
      "C2CC3CC": 1921,
      "C1CNC1": 1922,
      "CCCCCCNC": 1923,
      "-]#": 1924,
      "OCC2CC2": 1925,
      "cc2N1": 1926,
      "OCc2c": 1927,
      "OC1CCN": 1928,
      "CN3CCCC3": 1929,
      "csc1": 1930,
      "CC12CCC": 1931,
      "c4ccccc4F": 1932,
      "CCSc1ccc": 1933,
      "2CCCCC2": 1934,
      "COC1C": 1935,
      "cc1C1": 1936,
      "NO1": 1937,
      "c1cccc2cccnc12": 1938,
      "CCCCCc1ccc": 1939,
      "c3nccs3": 1940,
      "C12C": 1941,
      "C4O": 1942,
      "ccc3o2": 1943,
      "cc1NS": 1944,
      "c3cc4cc": 1945,
      "c24": 1946,
      "C5CC": 1947,
      "9c": 1948,
      "Cc4cccc": 1949,
      "c5c6": 1950,
      "CC1CCC2": 1951,
      "SiH3": 1952,
      "c2ncccc12": 1953,
      "1OCc1ccccc1": 1954,
      "nc2sc3c": 1955,
      "c1nccn1C": 1956,
      "CSc1cc": 1957,
      "CO4": 1958,
      "3NC": 1959,
      "2CS": 1960,
      "CCOc1ccc2c": 1961,
      "c6cccc7c6": 1962,
      "sc2c1CCCC2": 1963,
      "CCCNc1cc": 1964,
      "n1cccc1": 1965,
      "c3nccc": 1966,
      "ccc1n2": 1967,
      "C1CCCCCC1": 1968,
      "OC2CCCC2": 1969,
      "OC1OC": 1970,
      "N2c3ccccc3": 1971,
      "cc2o1": 1972,
      "C3N": 1973,
      "c4c5ccccc5c": 1974,
      "2CCS": 1975,
      "c9ccc": 1976,
      "c1cccc3": 1977,
      "Nn2c": 1978,
      "Cc1cc2nc": 1979,
      "oc5ccccc56": 1980,
      "c6ccc7ccccc7": 1981,
      "N1Cc1ccc": 1982,
      "CCCCCCCCCCCCCCCCCCCCCCCC": 1983,
      "1c1cc": 1984,
      "cc3c3cc": 1985,
      "CC3CCC": 1986,
      "1c1ncc": 1987,
      "CCCN1CCN": 1988,
      "CCC12C": 1989,
      "n3ncc": 1990,
      "CCF": 1991,
      "CCN2CCOCC2": 1992,
      "cnc3": 1993,
      "ccc4c": 1994,
      "3CC4CC": 1995,
      "n2n": 1996,
      "Nc2ccccc2F": 1997,
      "CCCCCCC1": 1998,
      "1Cc2ccccc2": 1999,
      "nc2n": 2000,
      "CCCCCCCCCCCCCCCCCCCCCCC": 2001,
      "c1C1": 2002,
      "Rb": 2003,
      "1CCc2c": 2004,
      "Cc1ccccc1OC": 2005,
      "NC1CCCN": 2006,
      "CCS2": 2007,
      "c1cc2cccc": 2008,
      "sc4": 2009,
      "c5ncc": 2010,
      "11c": 2011,
      "c2ccccc2NC": 2012,
      "c7cccc8": 2013,
      "NCCc2ccccc2": 2014,
      "noc2C": 2015,
      "c1nnc2n1": 2016,
      "n2cnc": 2017,
      "CN1CC2": 2018,
      "c1cscn1": 2019,
      "c1ccc2ccc": 2020,
      "NCCCOC": 2021,
      "N1CCc2ccccc21": 2022,
      "c1cncnc1": 2023,
      "OCC1OC": 2024,
      "CCOc1nc": 2025,
      "Cc3ccccn3": 2026,
      "c2nc3ccccc3o2": 2027,
      "c1cc2nc": 2028,
      "Cc1nccc": 2029,
      "N1CCc2sccc2": 2030,
      "N2CCNC": 2031,
      "CCOCCC": 2032,
      "Nc1ccc2nc": 2033,
      "ccn4": 2034,
      "c2O1": 2035,
      "CCSCC": 2036,
      "COc1ccccc1N1CCN": 2037,
      "c1cnn2": 2038,
      "Cn2ccnc2": 2039,
      "C3CCC4": 2040,
      "NC3CCC": 2041,
      "Cc4c": 2042,
      "CCCOc1c": 2043,
      "3N": 2044,
      "c2scc": 2045,
      "c2cc3ccc": 2046,
      "c5cc6ccccc6": 2047,
      "CN3CC": 2048,
      "NC1CCCCCC1": 2049,
      "c5cccnc5": 2050,
      "Oc2ccccc21": 2051,
      "COC1CCC": 2052,
      "COCCOc1ccc": 2053,
      "n2cnnn2": 2054,
      "Nc2ccccc2Cl": 2055,
      "OCCC2": 2056,
      "nc7": 2057,
      "CN2CCC3": 2058,
      "NCC1CCCO1": 2059,
      "OCCCOC": 2060,
      "c4O": 2061,
      "ns1": 2062,
      "c4ccccc4Cl": 2063,
      "@@+]([": 2064,
      "c2no": 2065,
      "c2ccc3ccc": 2066,
      "se": 2067,
      "c1ccc3": 2068,
      "C3CCNCC3": 2069,
      "CCOCCOC": 2070,
      "CNC1CCC": 2071,
      "CCCc2ccccc2": 2072,
      "@+]([": 2073,
      "cccc1OC": 2074,
      "c7ccccc7n": 2075,
      "Sc2cc": 2076,
      "c2ccc2": 2077,
      "C2CCS": 2078,
      "N2CCO": 2079,
      "Nc1nccs1": 2080,
      "NCc2cccnc2": 2081,
      "B2": 2082,
      "NH4": 2083,
      "c3ccc4nc": 2084,
      "c3ccccc3c": 2085,
      "Sc2nnc": 2086,
      "n2ncc3": 2087,
      "5OC": 2088,
      "NCc1cn": 2089,
      "cc3O": 2090,
      "CCCCCCOc1ccc": 2091,
      "c4nccc": 2092,
      "COC1CCN": 2093,
      "C3CCC2": 2094,
      "ncc23": 2095,
      "CCC1O": 2096,
      "N5CCOCC5": 2097,
      "Nc1ccnc": 2098,
      "C4CCCC4": 2099,
      "Cc1cc2ccccc2": 2100,
      "Fc1ccccc1": 2101,
      "ccc2N1": 2102,
      "c1c2cc": 2103,
      "c6ccc7ccccc7c6": 2104,
      "sc23": 2105,
      "Ca": 2106,
      "cc9": 2107,
      "c2cccnc12": 2108,
      "Cc3ccccc3F": 2109,
      "CCCn1nc": 2110,
      "sc7ccccc7": 2111,
      "Oc4cc": 2112,
      "N3CCCCCC3": 2113,
      "C2CCC3": 2114,
      "Nc2cn": 2115,
      "N2CCc3ccccc3C2": 2116,
      "NCC1CN": 2117,
      "OCCCCCCCCCCCC": 2118,
      "ncnc43": 2119,
      "Cc3cccs3": 2120,
      "CCC1N": 2121,
      "c1ccc2ccccc2n1": 2122,
      "C1COC": 2123,
      "c3ccccc13": 2124,
      "c2nc3ccccc3n2": 2125,
      "OC2CCC": 2126,
      "c1nc2ccccc2o1": 2127,
      "NC2CCCC": 2128,
      "6OC": 2129,
      "c2ccc3ccccc3n2": 2130,
      "c1nccn1": 2131,
      "COc1ccnc": 2132,
      "NCc3cccc": 2133,
      "c1OCc1ccccc1": 2134,
      "CCSCC1": 2135,
      "c1ccccc1OCC": 2136,
      "CCCC1CC": 2137,
      "Sc3ccccc3": 2138,
      "CCCCCCCCN": 2139,
      "co2": 2140,
      "sc2c": 2141,
      "NCC4": 2142,
      "NCC1CCCCC1": 2143,
      "Cc2nnc": 2144,
      "noc1C": 2145,
      "H2": 2146,
      "CNc2cccc": 2147,
      "OCO": 2148,
      "ccc3O": 2149,
      "C1CCCO1": 2150,
      "c3ccccc3n": 2151,
      "CCn1ccc": 2152,
      "c2cccc3c2o": 2153,
      "Nc5ccc": 2154,
      "n4nc": 2155,
      "Nc2ccccc21": 2156,
      "3CCCC3": 2157,
      "ccc8": 2158,
      "cc5c4": 2159,
      "cc4C3": 2160,
      "CCCCCN1C": 2161,
      "c4nnc": 2162,
      "n32": 2163,
      "sc3n2": 2164,
      "NCc2ccc3c": 2165,
      "C1CCCC2": 2166,
      "4CCCC": 2167,
      "3COC": 2168,
      "nc3sc": 2169,
      "CCOS": 2170,
      "n2nnnc2": 2171,
      "N1CCNC": 2172,
      "CNCCCC": 2173,
      "NCc1ccnc": 2174,
      "NCc1cccs1": 2175,
      "sc4ccccc45": 2176,
      "C3CN": 2177,
      "Nn1c": 2178,
      "CCCN3C": 2179,
      "N21": 2180,
      "c1cc3c": 2181,
      "c1cc2n": 2182,
      "Cc5ccc": 2183,
      "Nc2sc3c": 2184,
      "Nc1sc2c": 2185,
      "CNC1CCN": 2186,
      "CCCCCCOC": 2187,
      "n1cncn1": 2188,
      "cc3c1": 2189,
      "NN1C": 2190,
      "COCC2": 2191,
      "1F": 2192,
      "c5cc6c": 2193,
      "1CCO": 2194,
      "c2ccccc2c1C": 2195,
      "c4cccc5c4oc4ccccc45": 2196,
      "c1cc2c3c": 2197,
      "N3CCC4": 2198,
      "CN1C2": 2199,
      "c3nc4cc": 2200,
      "Cn1nccc1": 2201,
      "c4cncc": 2202,
      "NOCC": 2203,
      "c7ccc8c": 2204,
      "c3cnccn3": 2205,
      "NC1CC2": 2206,
      "CCC1CCCC1": 2207,
      "N2CCCC2C": 2208,
      "CCn2c": 2209,
      "32C": 2210,
      "n4cnc5c": 2211,
      "nn1CC": 2212,
      "CCCOC1": 2213,
      "CCc1cn": 2214,
      "OCc1cccc": 2215,
      "CCN1CCCCC1": 2216,
      "Sc1nc": 2217,
      "c1nc2ccccc2n1": 2218,
      "N2N": 2219,
      "2CN1C": 2220,
      "c1ccc2c3c": 2221,
      "Oc3": 2222,
      "NC3CCCC3": 2223,
      "CCCO4": 2224,
      "NCC2CCCO2": 2225,
      "CC1CS": 2226,
      "N3CC4": 2227,
      "C2CCCO2": 2228,
      "C1CNC": 2229,
      "cnn": 2230,
      "NC1CN": 2231,
      "n3cccc3": 2232,
      "CC3CCCCC3": 2233,
      "cc2c1O": 2234,
      "CCN2CCN": 2235,
      "Cc1cnc2c": 2236,
      "c3OC": 2237,
      "n3cnn": 2238,
      "OCCCNC": 2239,
      "C2CCCNC2": 2240,
      "5c": 2241,
      "NCc1ccccn1": 2242,
      "CCOc1cc2c": 2243,
      ")(/": 2244,
      "sc21": 2245,
      "C2CCOC2": 2246,
      "N2CCc3ccccc32": 2247,
      "SCC2": 2248,
      "Cc1cccc2c": 2249,
      "c2cc3ccccc3o2": 2250,
      "Nc1ncnc2c1ncn2": 2251,
      "NC3CCN": 2252,
      "Cc3ccccc3Cl": 2253,
      "cnc1N": 2254,
      "c5ccccc5C": 2255,
      "N5C": 2256,
      "1CCOC1": 2257,
      "cc2S": 2258,
      "Cc2ncc": 2259,
      "CCC6": 2260,
      "Cc3nc": 2261,
      "CC3C2": 2262,
      "c2cc3nc": 2263,
      "CCc1": 2264,
      "CCCCCCCCCCCCCCCCCCCCCCCCC": 2265,
      "OC2CCCCC2": 2266,
      "NCC1CC1": 2267,
      "CCc1noc": 2268,
      "CSc2n": 2269,
      "nnc1C": 2270,
      "c4ccnc": 2271,
      "cc4s3": 2272,
      "n2N": 2273,
      "c1cc3": 2274,
      "n2c3c": 2275,
      "C3OC": 2276,
      "Cc1ccccc1O": 2277,
      "Nc1cccc2ccccc12": 2278,
      "c31": 2279,
      "cn2C": 2280,
      "Nc1ccccn1": 2281,
      "As": 2282,
      "CCCOc1ccccc1": 2283,
      "4CCOCC4": 2284,
      "Nc2cccc3": 2285,
      "c2c34": 2286,
      "c1cn2c": 2287,
      "cn5": 2288,
      "COCc3ccccc3": 2289,
      "n3ccccc3": 2290,
      "CSCc1ccc": 2291,
      "CCCCCCCCOC": 2292,
      "ncnc2": 2293,
      "c8cccc": 2294,
      "COc1ccccc1CNC": 2295,
      "CNCc2ccc": 2296,
      "CCNCc1cc": 2297,
      "+]/": 2298,
      "CC1CCNCC1": 2299,
      "NCCN1CCOCC1": 2300,
      "SCCN": 2301,
      "c8c": 2302,
      "c2cccc4": 2303,
      "FF": 2304,
      "NCC2CCC": 2305,
      "1OCC": 2306,
      "c3nnnn3": 2307,
      "CCOCCCNC": 2308,
      "4CCN": 2309,
      "n6c7ccccc7c7ccccc76": 2310,
      "Nc2nc3c": 2311,
      "CCC1CC1": 2312,
      "CC12CC3CC": 2313,
      "c2cccc3c": 2314,
      "3CCCN3C": 2315,
      "CCC1NC": 2316,
      "c2cncnc2": 2317,
      "18": 2318,
      "n2cnnc2": 2319,
      "C1CC1C": 2320,
      "NCCOc1ccc": 2321,
      "cc2nc": 2322,
      "B3OC": 2323,
