{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[UNK]": 0,
      "#": 1,
      "%": 2,
      "(": 3,
      ")": 4,
      "+": 5,
      "-": 6,
      ".": 7,
      "/": 8,
      "0": 9,
      "1": 10,
      "2": 11,
      "3": 12,
      "4": 13,
      "5": 14,
      "6": 15,
      "7": 16,
      "8": 17,
      "9": 18,
      "=": 19,
      "@": 20,
      "A": 21,
      "B": 22,
      "C": 23,
      "F": 24,
      "H": 25,
      "I": 26,
      "K": 27,
      "L": 28,
      "M": 29,
      "N": 30,
      "O": 31,
      "P": 32,
      "R": 33,
      "S": 34,
      "T": 35,
      "X": 36,
      "Z": 37,
      "[": 38,
      "\\": 39,
      "]": 40,
      "a": 41,
      "b": 42,
      "c": 43,
      "e": 44,
      "g": 45,
      "i": 46,
      "l": 47,
      "n": 48,
      "o": 49,
      "p": 50,
      "r": 51,
      "s": 52,
      "t": 53,
      "cc": 54,
      "CC": 55,
      "(=": 56,
      "c1": 57,
      "c2": 58,
      "ccc": 59,
      "](": 60,
      "cccc": 61,
      "@@": 62,
      "NC": 63,
      ")[": 64,
      "c3": 65,
      "OC": 66,
      "CCC": 67,
      "c1ccc": 68,
      "cc1": 69,
      "nc": 70,
      "Cl": 71,
      "CO": 72,
      "(-": 73,
      "CCCC": 74,
      "c1cccc": 75,
      ")(": 76,
      "c2cccc": 77,
      "c1cc": 78,
      "c2ccc": 79,
      "CCN": 80,
      "n1": 81,
      "C1": 82,
      "cc2": 83,
      "CN": 84,
      "c2ccccc2": 85,
      "ccccc": 86,
      "c1ccccc1": 87,
      "n2": 88,
      "nH": 89,
      "CC1": 90,
      ")=": 91,
      "C2": 92,
      "c4": 93,
      ")(=": 94,
      "c2c": 95,
      "N1": 96,
      "ccccc3": 97,
      "c3ccc": 98,
      "c1c": 99,
      "cc3": 100,
      "c3ccccc3": 101,
      "CC2": 102,
      "CCO": 103,
      "c2cc": 104,
      "N2": 105,
      "-]": 106,
      "c1n": 107,
      "Cc1ccc": 108,
      "1C": 109,
      "CCCCC": 110,
      "+]": 111,
      "nc2": 112,
      "([": 113,
      "COc1ccc": 114,
      "C3": 115,
      "@]": 116,
      "n3": 117,
      "CC3": 118,
      "c2n": 119,
      "Br": 120,
      "COC": 121,
      "-])": 122,
      "@@]": 123,
      "c3c": 124,
      "c12": 125,
      "CS": 126,
      "COc1cc": 127,
      "Cc1cc": 128,
      "c3cc": 129,
      "c1nc": 130,
      "CNC": 131,
      "(/": 132,
      "Cc1ccccc1": 133,
      "N3": 134,
      "c3cccc": 135,
      "c2nc": 136,
      "2C": 137,
      "ccccc4": 138,
      "+](=": 139,
      "Cc1c": 140,
      "ccc2": 141,
      "NCC": 142,
      "nc1": 143,
      "CCOC": 144,
      "OCC": 145,
      ")/": 146,
      "CCCN": 147,
      "nc3": 148,
      "c4ccc": 149,
      "ccc1": 150,
      "CCCCCCCC": 151,
      "s1": 152,
      "nn": 153,
      "1O": 154,
      "c5": 155,
      "c4ccccc4": 156,
      "Nc1ccc": 157,
      "c2c1": 158,
      "n1c": 159,
      "1CC": 160,
      "cc4": 161,
      "c2ccc3": 162,
      "CCCNC": 163,
      "NS": 164,
      "o1": 165,
      "Cc2ccccc2": 166,
      "CCCCN": 167,
      "NC1": 168,
      "3C": 169,
      "+](": 170,
      "2O": 171,
      "CN1": 172,
      "CC4": 173,
      "CCNC": 174,
      "Cc2ccc": 175,
      "c1C": 176,
      "ccc3": 177,
      "N1CCC": 178,
      "N1C": 179,
      "SC": 180,
      "c23": 181,
      "sc": 182,
      "N1CCN": 183,
      "s2": 184,
      "n2c": 185,
      "nc4": 186,
      "C4": 187,
      "ncc": 188,
      "c1ccc2c": 189,
      "o2": 190,
      "c2ccccc12": 191,
      "Nc2ccc": 192,
      "12": 193,
      "Cc1cccc": 194,
      "O2": 195,
      "N2C": 196,
      "cc1OC": 197,
      ".[": 198,
      "2c": 199,
      "oc": 200,
      "Cc1n": 201,
      "CN2": 202,
      "CCCCC1": 203,
      "N2CCN": 204,
      "n4": 205,
      "cn1": 206,
      "COc1cccc": 207,
      "n1cc": 208,
      "NCCC": 209,
      "CCCCC2": 210,
      "O1": 211,
      "1CCC": 212,
      "NC2": 213,
      "3O": 214,
      "Nc1cc": 215,
      "CCCC2": 216,
      "c2ccccc21": 217,
      "c2ccc3c": 218,
      "nn2": 219,
      "Nc1n": 220,
      "c4c": 221,
      "cc1C": 222,
      "Nc3ccc": 223,
      "c2cc3": 224,
      "N4": 225,
      "COc1ccccc1": 226,
      "CCN1": 227,
      "CCCC1": 228,
      "c4cc": 229,
      "Nc1nc": 230,
      "Cn1c": 231,
      "CCS": 232,
      "nn1": 233,
      "O3": 234,
      "2CC": 235,
      "Oc1ccc": 236,
      "c1OC": 237,
      "Nc1cccc": 238,
      "]([": 239,
      "CCOCC2": 240,
      "@@](": 241,
      "C1C": 242,
      "CCC1": 243,
      "Cc3ccccc3": 244,
      "c3ccccc23": 245,
      "cccc2": 246,
      "Cc2c": 247,
      "ncc2": 248,
      "(\\": 249,
      "CN1C": 250,
      "3CC": 251,
      "CCC2": 252,
      "c1O": 253,
      "c3nc": 254,
      "4c": 255,
      "+]([": 256,
      "c3n": 257,
      "N1CC": 258,
      "CCCC3": 259,
      "N2CCC": 260,
      "Nc1ccccc1": 261,
      "CCCCC3": 262,
      "c2C": 263,
      "SCC": 264,
      "n2cc": 265,
      "@](": 266,
      "cn2": 267,
      "cc12": 268,
      "cc1Cl": 269,
      "s3": 270,
      "=[": 271,
      "c4cccc": 272,
      "4C": 273,
      "c2cn": 274,
      "CCOCC3": 275,
      "c1cn": 276,
      "CCOc1ccc": 277,
      "CCOCC1": 278,
      "NO": 279,
      "Cc3ccc": 280,
      "c3c2": 281,
      "NCCN": 282,
      "c2nnc": 283,
      "ccccc5": 284,
      "1CN": 285,
      "Cc1nc": 286,
      "N3CCN": 287,
      "CN1CCN": 288,
      "OCCO": 289,
      "OCCC": 290,
      "Cn1": 291,
      "o3": 292,
      "Nc2ccccc2": 293,
      "1OC": 294,
      "cc21": 295,
      "Oc2ccc": 296,
      "NC3": 297,
      "c2ncc": 298,
      "nc2c1": 299,
      "Nc2cc": 300,
      "nc12": 301,
      "c2cccc3": 302,
      "N2CCOCC2": 303,
      "c1cc2": 304,
      "c3ccccc32": 305,
      "c2n1": 306,
      "NCc1ccc": 307,
      "CCC3": 308,
      "c1nnc": 309,
      "O4": 310,
      "NCCCC": 311,
      "ccc21": 312,
      "c2ccccc2c1": 313,
      "nn3": 314,
      "Na": 315,
      "ccc4": 316,
      "2CCC": 317,
      "C1CCN": 318,
      "c2cccnc2": 319,
      "Cn1cc": 320,
      "n3c": 321,
      "N2CC": 322,
      "CCc1ccc": 323,
      "ncc3": 324,
      "c5ccccc5": 325,
      "1NC": 326,
      "OC1": 327,
      "C2C": 328,
      "c5ccc": 329,
      "cccc3": 330,
      "cc1F": 331,
      "n2C": 332,
      "nc2c": 333,
      "CCN1C": 334,
      "CN3": 335,
      "CC5": 336,
      "Nc2nc": 337,
      "C1CC": 338,
      "ccc1O": 339,
      "nc5": 340,
      "CCn1c": 341,
      "N3CCOCC3": 342,
      "COc1ccc2c": 343,
      "c6": 344,
      "c2nc3ccccc3": 345,
      "OC2": 346,
      "COP": 347,
      "ncc1": 348,
      "NN": 349,
      "nc32": 350,
      "c2ccccn2": 351,
      "Cc1": 352,
      "CCCCCC": 353,
      "nc3c": 354,
      "c1ncc": 355,
      "c1cccc2": 356,
      "C5": 357,
      "OCc1ccccc1": 358,
      "CCOCCO": 359,
      "cc1O": 360,
      "c1cnc": 361,
      "COc1cc2c": 362,
      "NNC": 363,
      "cccc1": 364,
      "c21": 365,
      "1CCCN1C": 366,
      "n2nc": 367,
      "OCCN": 368,
      "ccc12": 369,
      "nc21": 370,
      "c1cc2c": 371,
      "cc2Cl": 372,
      "c2ccncc2": 373,
      "ccccc34": 374,
      "OCO3": 375,
      "cn3": 376,
      "c3nc4": 377,
      "cc2c1": 378,
      ")-": 379,
      "c2ccccc2C": 380,
      "N1CCOCC1": 381,
      "cc5": 382,
      "12C": 383,
      "CCCO": 384,
      "Cc1cnc": 385,
      "4CC": 386,
      "Nc2cccc": 387,
      "N3CCC": 388,
      "C2CC2": 389,
      "N3C": 390,
      "c2cc3c": 391,
      "c1cccnc1": 392,
      "cc2C": 393,
      "OP": 394,
      "Nc3ccccc3": 395,
      "21": 396,
      "c1ccc2": 397,
      "CCCCNC": 398,
      "c2cnc": 399,
      "cn": 400,
      "no1": 401,
      "Oc3ccc": 402,
      "c2cccs2": 403,
      "CCOCC4": 404,
      "4O": 405,
      "OCO2": 406,
      "c2ccco2": 407,
      "Cn2c": 408,
      "CN2C": 409,
      "cc2F": 410,
      "cs1": 411,
      "CCCCCCC": 412,
      "OCc2ccccc2": 413,
      "CCc1ccccc1": 414,
      "c3ccccn3": 415,
      "cc23": 416,
      "c1nc2ccccc2": 417,
      "Cc1ccc2c": 418,
      "n3cc": 419,
      "NCc1ccccc1": 420,
      "CCCC4": 421,
      "/[": 422,
      "C1CC1": 423,
      ")([": 424,
      "Nc3cc": 425,
      "C3CC3": 426,
      "Nc2n": 427,
      "C2CCN": 428,
      "c3cccnc3": 429,
      "n1C": 430,
      "OCO4": 431,
      "Nc1c": 432,
      "5CC": 433,
      "c1cccs1": 434,
      "ccc23": 435,
      "c2ccc3ccccc3": 436,
      "CN2CCN": 437,
      "c1Cl": 438,
      "c1ccccn1": 439,
      "21C": 440,
      "c3ccc4c": 441,
      "C1CCCCC1": 442,
      "COc1cc2": 443,
      "c1ccco1": 444,
      "S1": 445,
      "Cc2cc": 446,
      "NCC1": 447,
      "nc23": 448,
      "c3ccncc3": 449,
      "ccc2c1": 450,
      "23": 451,
      "CCC4": 452,
      "CN1CC": 453,
      "C2CC": 454,
      "ccccc12": 455,
      "OS": 456,
      "CCN1CCN": 457,
      "5C": 458,
      "cc2c": 459,
      "oc2c1": 460,
      "nc1C": 461,
      "2CCN": 462,
      "2OC": 463,
      "Nc4ccc": 464,
      "c3ccc4": 465,
      "Nc1ccc2c": 466,
      "c1s": 467,
      "Cc4ccccc4": 468,
      "c3C": 469,
      "COc1c": 470,
      "2CN": 471,
      "C1CCC": 472,
      "Nc1ncc": 473,
      "CN1CCC": 474,
      "N2CCCC2": 475,
      "c1nn": 476,
      "Cc1nn": 477,
      "nc3c2": 478,
      "c1ccncc1": 479,
      "c2ccccc2Cl": 480,
      "cc1NC": 481,
      "N2CCCCC2": 482,
      "N1CCCC1": 483,
      "c2nn": 484,
      "c2s": 485,
      "c3ncc": 486,
      "nc2n1": 487,
      "Cc1cn": 488,
      "Cc2cccc": 489,
      "c3ccco3": 490,
      "CSCC": 491,
      "NCCO": 492,
      "OCCCC": 493,
      "sc1": 494,
      "c4ccccc34": 495,
      "c2csc": 496,
      "ccn1": 497,
      "C2CCCCC2": 498,
      "Nc3cccc": 499,
      "COc2ccc": 500,
      "Oc1ccccc1": 501,
      "C1NC": 502,
      "COCC": 503,
      "nc3cc": 504,
      "CCOc1cc": 505,
      "cc32": 506,
      "oc1": 507,
      "CCCCCCCCCCCCCCCC": 508,
      "ccc1C": 509,
      "CSC": 510,
      "c3cn": 511,
      "c2ccc3ccccc3c2": 512,
      "Nc2c": 513,
      "CCc1cc": 514,
      "CCCCC4": 515,
      "c3cnc": 516,
      "+].[": 517,
      "N1CCCC": 518,
      "OC3": 519,
      "5c": 520,
      "NCc2ccc": 521,
      "c1nc2c": 522,
      "ccccc23": 523,
      "Oc1cc": 524,
      "2C1": 525,
      "c3cccs3": 526,
      "nnc": 527,
      "c2ccccc2C1": 528,
      "sc2": 529,
      "sc2c1": 530,
      "CCn1": 531,
      "cc3c": 532,
      "CCc1c": 533,
      "CCSC": 534,
      "NCCCN": 535,
      "c3n2": 536,
      "c2ccccc2n1": 537,
      "Oc2ccccc2": 538,
      "nc2cc": 539,
      "CCCCCCCCCCCC": 540,
      "cc3F": 541,
      "Cc4ccc": 542,
      "43C": 543,
      "N3CC": 544,
      "1CCN": 545,
      "ncn1": 546,
      "c1ccccc1C": 547,
      "CC3CC": 548,
      "c3cccc4": 549,
      "c5c": 550,
      "nnc1": 551,
      "oc2": 552,
      "N1CCCCC1": 553,
      "OCc3ccccc3": 554,
      "NC4": 555,
      "5O": 556,
      "c1ccccc1Cl": 557,
      "cs2": 558,
      "ncn2": 559,
      "ncnc32": 560,
      "C2CCC": 561,
      "n3C": 562,
      "N5": 563,
      "c3cc4c": 564,
      "c3ccccc3C": 565,
      "Clc1ccc": 566,
      "Cn2": 567,
      "12CC": 568,
      "c5cc": 569,
      "C1O": 570,
      "no2": 571,
      "CCc2ccccc2": 572,
      "c3ccccc3C2": 573,
      "nc2c1nc": 574,
      "6O": 575,
      "no": 576,
      "CNS": 577,
      "2CCCN2C": 578,
      "Fc1ccc": 579,
      "N3CCCCC3": 580,
      "N3CCCC3": 581,
      "NCC2": 582,
      "N4CCN": 583,
      "ccccc2": 584,
      "N2CCCC": 585,
      "c2nc3c": 586,
      "CN2CCC": 587,
      "oc2cc": 588,
      "ncnc": 589,
      "COc1ccc2": 590,
      "c1F": 591,
      "32": 592,
      "c2O": 593,
      "1CO": 594,
      "N4CCOCC4": 595,
      "S2": 596,
      "c2ccccc2F": 597,
      "c1cncc": 598,
      "FC": 599,
      "c2cc1OC": 600,
      "c1csc": 601,
      "cc3Cl": 602,
      "CCn1cc": 603,
      "nc2ccccc12": 604,
      "n2cnc3c": 605,
      "ccc32": 606,
      "Oc2cc": 607,
      "c4c3": 608,
      "C1N": 609,
      "CCCl": 610,
      "COc1cccc2": 611,
      "NCc2ccccc2": 612,
      "-].[": 613,
      "c3nc4ccccc4": 614,
      "c3nn": 615,
      "CCN2": 616,
      "s4": 617,
      "-])[": 618,
      "Cn2cc": 619,
      "CCN3": 620,
      "OCC1": 621,
      "cccc4": 622,
      "ccc2n1": 623,
      "Cc1noc": 624,
      "1N": 625,
      "3OC": 626,
      "c34": 627,
      "CCCS": 628,
      "c3cc4": 629,
      "c2nnn": 630,
      "c1sc": 631,
      "CSSC": 632,
      "ccc1OC": 633,
      "c32": 634,
      "nc2c1ncn2": 635,
      "c2c1C": 636,
      "Cc1cc2": 637,
      "CCCn1c": 638,
      "c2sc": 639,
      "c2cc3ccccc3": 640,
      "c3ccccc3c2": 641,
      "COCCN": 642,
      "on1": 643,
      "CC1CCCCC1": 644,
      "cccn2": 645,
      "c2cccc3ccccc23": 646,
      "ncc4": 647,
      "C3CCCCC3": 648,
      "n12": 649,
      "Cc1cccc2": 650,
      "CC1C": 651,
      "c2C1": 652,
      "n5": 653,
      "ccc1Cl": 654,
      "o4": 655,
      "c1NC": 656,
      "C12": 657,
      "C3C": 658,
      "CCl": 659,
      "nc2ccc": 660,
      "c2ccnc": 661,
      "cc1S": 662,
      "OCC2": 663,
      "c2o": 664,
      "c3nnc": 665,
      "c2nc3cc": 666,
      "c4ccccc43": 667,
      "n4c": 668,
      "Oc3ccccc3": 669,
      "Nc2ccc3c": 670,
      "Cc3c": 671,
      "COC1": 672,
      "c1ccc2nc": 673,
      "CCOc1ccccc1": 674,
      "CN2CC": 675,
      "cccc12": 676,
      "c1c2c": 677,
      "C4CC4": 678,
      "nc2C": 679,
      "c1ccccc1F": 680,
      "CN4": 681,
      "NC1CCCCC1": 682,
      "N1CCC2": 683,
      "CO2": 684,
      "cccc1C": 685,
      "3CCC": 686,
      "Nc1nnc": 687,
      "cc3C": 688,
      "CC1CCN": 689,
      "Oc1cccc": 690,
      "c2cncc": 691,
      "23C": 692,
      "nn12": 693,
      "O5": 694,
      "C3CCN": 695,
      "Cc3cccc": 696,
      "c1ccc2ccccc2c1": 697,
      "CSc1nnc": 698,
      "n4cc": 699,
      "Cc1cc2c": 700,
      "c1cccc2ccccc12": 701,
      "CNCC": 702,
      "c2noc": 703,
      "1CCCC": 704,
      "SC1": 705,
      "Nc2ncc": 706,
      "c1nc2cc": 707,
      "ccc3c2": 708,
      "nc3ccccc23": 709,
      "CCN2C": 710,
      "c3ccccc3Cl": 711,
      "CC4CC": 712,
      "oc3": 713,
      "n1Cc1ccc": 714,
      "c1N": 715,
      "c1cc2cc": 716,
      "NCc3ccc": 717,
      "c2ccc3nc": 718,
      "CC1CC1": 719,
      "ccc5": 720,
      "NCCN1": 721,
      "n3ccc": 722,
      "cc2C1": 723,
      "\\[": 724,
      "Si": 725,
      "OCc2ccc": 726,
      "c4nc": 727,
      "c1ccccc12": 728,
      "NC1CCN": 729,
      "CC1CC": 730,
      "nc2ccccc21": 731,
      "c13": 732,
      "c2ncccc2": 733,
      "ccn2": 734,
      "ccc1F": 735,
      "CSc1ccc": 736,
      "cc3c2": 737,
      "Cn1nc": 738,
      "ccc2C": 739,
      "c4n": 740,
      "c2c3c": 741,
      "OCCO2": 742,
      "OCCO3": 743,
      "c2ncn": 744,
      "c5cccc": 745,
      "NC2CCCCC2": 746,
      "c1nc2ccc": 747,
      "ccccc6": 748,
      "nn4": 749,
      "](/": 750,
      "C1c1ccc": 751,
      "c2cnn": 752,
      "ccccc4c3": 753,
      "n1nc": 754,
      "oc12": 755,
      "c1o": 756,
      "CCOP": 757,
      "cc2O": 758,
      "CCc1nc": 759,
      "Cc1nnc": 760,
      "c1c2ccccc2": 761,
      "c2F": 762,
      "n3nc": 763,
      "NCc3ccccc3": 764,
      "CCN1CCC": 765,
      "CC2CC2": 766,
      "Oc1c": 767,
      "c1cc2ccccc2": 768,
      "CCCCCCCCC": 769,
      "ccc34": 770,
      "CN3CCN": 771,
      "C1CCCN": 772,
      "nnc2": 773,
      "c3ccnc": 774,
      "cccc1Cl": 775,
      "c7": 776,
      "nc2c1c": 777,
      "c2oc": 778,
      "nc3ccc": 779,
      "c2Cl": 780,
      "COc1ccccc1N1CCN": 781,
      "C1CN": 782,
      "CC2C": 783,
      "C6": 784,
      "1c1ccc": 785,
      "CCCOc1ccc": 786,
      "cc2s1": 787,
      "CNc1nc": 788,
      "C1CCCC1": 789,
      "n2c1": 790,
      "CCCCCCCCCC": 791,
      "CSc1nc": 792,
      "2CO": 793,
      "13": 794,
      "Cc1cccnc1": 795,
      "c2ncnc": 796,
      "CCc2ccc": 797,
      "CCc3ccccc3": 798,
      "c3nccc": 799,
      "c1ccnc": 800,
      "c1nnn": 801,
      "Nc3nc": 802,
      "C2O": 803,
      "n2ccnc2": 804,
      "NCCNC": 805,
      "Cc1ncc": 806,
      "c2nc3ccc": 807,
      "7O": 808,
      "ccc2O": 809,
      "cccc2Cl": 810,
      "sc3": 811,
      "cn4": 812,
      "cc2OC": 813,
      "nc4c": 814,
      "c4ccccn4": 815,
      "COCCO": 816,
      "CC1CN": 817,
      "cc1Br": 818,
      "nn23": 819,
      "cc34": 820,
      "CO1": 821,
      "1C2": 822,
      "CCNS": 823,
      "c2cc3cc": 824,
      "34": 825,
      "c4cccnc4": 826,
      "CSc2nnc": 827,
      "Cc3cc": 828,
      "c3cnn": 829,
      "2CCCC": 830,
      "C3CC": 831,
      "ccccc45": 832,
      "c2ccccc2O": 833,
      "c1ccccc1O": 834,
      "c4ccncc4": 835,
      "CCCCCNC": 836,
      "COc2ccccc2": 837,
      "CC3CC3": 838,
      "cnc2": 839,
      "on2": 840,
      "c4cnc": 841,
      "nc1N": 842,
      "Cc1csc": 843,
      "3CC4CC": 844,
      "C1C2": 845,
      "n2ccc": 846,
      "Nc1ccccc1C": 847,
      "+]=[": 848,
      "sc1C": 849,
      "6C": 850,
      "c3ccccc3F": 851,
      "COc1ccccc1C": 852,
      "2NC": 853,
      "C2CCCC2": 854,
      "C1OC": 855,
      "C4C": 856,
      "CCN1CC": 857,
      "c1cnn": 858,
      "COc3ccc": 859,
      "NOC": 860,
      "Oc2c": 861,
      "CC1CCC": 862,
      "CCc1cccc": 863,
      "CCO2": 864,
      "NCCN2": 865,
      "nc3n2": 866,
      "c3ccccc3n2": 867,
      "c1ccc2cc": 868,
      "Oc1ccc2c": 869,
      "Cc1ccc2nc": 870,
      "cc2n1": 871,
      "Cc1o": 872,
      "3c": 873,
      "CCCOC": 874,
      "c4nc5": 875,
      "c2ccccc2S": 876,
      "N3CCCC": 877,
      "CCOC1": 878,
      "CC2CCCCC2": 879,
      "Cc2cnc": 880,
      "CCCN1C": 881,
      "n1ccnc1": 882,
      "]%": 883,
      "CCOCC5": 884,
      "c2ncnc3": 885,
      "1CS": 886,
      "c1nccc": 887,
      "CP": 888,
      "NCCc1ccccc1": 889,
      "Oc2cccc": 890,
      "10": 891,
      "NCCS": 892,
      "Nc4cc": 893,
      "N1c1ccc": 894,
      "ccc2Cl": 895,
      "cccc23": 896,
      "c1ccccc1NC": 897,
      "nc34": 898,
      "Nc1cccc2": 899,
      "c6ccc": 900,
      "c4ccco4": 901,
      "N1N": 902,
      "cc6": 903,
      "ccc2F": 904,
      "cc1OCC": 905,
      "ncnc21": 906,
      "cc3OC": 907,
      "Nc3c": 908,
      "Cc2ccc3c": 909,
      "c6ccccc6": 910,
      "cccc2C": 911,
      "ccc3n2": 912,
      "NCc1cccc": 913,
      "c1noc": 914,
      "OCCCN": 915,
      "3C2": 916,
      "cnc": 917,
      "CCCc1cc": 918,
      "Cc1ccccc1C": 919,
      "CF": 920,
      "2N": 921,
      "n3ccnc3": 922,
      "ccc1NC": 923,
      "ncn3": 924,
      "c2nc3ccccc3s2": 925,
      "N4CCC": 926,
      "CCCC5": 927,
      "NCC3": 928,
      "c4ccc5": 929,
      "Nc2nnc": 930,
      "CCCO2": 931,
      "n3c2": 932,
      "COS": 933,
      "CCCCCCCCCCC": 934,
      "N2C1": 935,
      "c3C2": 936,
      "c5c4": 937,
      "Nc4ccccc4": 938,
      "Nc1nc2c": 939,
      "nc43": 940,
      "4CCC": 941,
      "Nc2ccccc2C": 942,
      "NCCc1ccc": 943,
      "2C3": 944,
      "c3cncc": 945,
      "c2nccc": 946,
      "NC1CC1": 947,
      "6CC": 948,
      "COc1nc": 949,
      "1CCCN1": 950,
      "c3s": 951,
      "NC2CCN": 952,
      "cnn1": 953,
      "NCc1cc": 954,
      "NCCN3": 955,
      "COc1ccccc1NC": 956,
      "cnn2": 957,
      "cc3C2": 958,
      "OCc4ccccc4": 959,
      "c2no": 960,
      "OCO5": 961,
      "3CN": 962,
      "12CCC": 963,
      "NP": 964,
      "NCCCCC": 965,
      "n2ncc": 966,
      "NC1CCCC1": 967,
      "ncnc2": 968,
      "N2CCC3": 969,
      "C3CCCC3": 970,
      "n2nn": 971,
      "n4cnc5": 972,
      "ccc3c": 973,
      "nc4cc": 974,
      "c1CC": 975,
      "SC2": 976,
      "CCCCn1c": 977,
      "c4ccc5c": 978,
      "c4ccccc4C3": 979,
      "ccc2OC": 980,
      "c3cc4ccccc4": 981,
      "NCc1ccco1": 982,
      "43": 983,
      "Oc3cc": 984,
      "c1C2": 985,
      "Cc1ccc2ccccc2c1": 986,
      "CCNC2": 987,
      "OCc1ccc": 988,
      "c3F": 989,
      "CNC1": 990,
      "CCOCCOCCOCCO": 991,
      "C1c2ccccc2C": 992,
      "c1S": 993,
      "cc3n2": 994,
      "cccc3Cl": 995,
      "2CC3CC": 996,
      "C3CCC": 997,
      "c1ccn": 998,
      "c1ccccc1C2": 999,
      "N4CCCC4": 1000,
      "c3ncnc": 1001,
      "CCCCN1C": 1002,
      "CCNc1nc": 1003,
      "cccc3F": 1004,
      "3OP": 1005,
      "SCCC": 1006,
      "Cc1nc2c": 1007,
      "])": 1008,
      "C2CCCN": 1009,
      "n3n2": 1010,
      "Nc2nccc": 1011,
      "c2c3ccccc3": 1012,
      "c3ccc4ccccc4c3": 1013,
      "ccc3C": 1014,
      "nc6": 1015,
      "COCCNC": 1016,
      "n2n1": 1017,
      "nc3ccccc32": 1018,
      "cnc1": 1019,
      "c4cccc5": 1020,
      "N1CCc2c": 1021,
      "c3cccc4ccccc34": 1022,
      "nc2s": 1023,
      "1c1ccccc1": 1024,
      "ccc2c": 1025,
      "cccc1F": 1026,
      "3CCN": 1027,
      "c3ccccc13": 1028,
      "Nc1ncnc2c1ncn2": 1029,
      "c2ccc3cc": 1030,
      "N4C": 1031,
      "OCc3ccc": 1032,
      "OC4": 1033,
      "ccc1OCC": 1034,
      "1CNC": 1035,
      "c4ccccc4C": 1036,
      "N3CCNCC3": 1037,
      "n23": 1038,
      "N1Cc2ccccc2": 1039,
      "OCCO4": 1040,
      "Sc2ccc": 1041,
      "CCCCO": 1042,
      "CCCCOC": 1043,
      "CN2CCOCC2": 1044,
      "CCOCC": 1045,
      "COC2": 1046,
      "c4cn": 1047,
      "3COC": 1048,
      "Cn1ccnc1": 1049,
      "c2ccsc2": 1050,
      "Oc4ccc": 1051,
      "CSc1n": 1052,
      "c2ncccn2": 1053,
      "Cc2cccnc2": 1054,
      "cccc21": 1055,
      "c4cnn": 1056,
      "oc2c": 1057,
      "OCC3": 1058,
      "CN3CCC": 1059,
      "Nc1nccc": 1060,
      "COc3ccccc3": 1061,
      "n1Cc1ccccc1": 1062,
      "Cc2ccco2": 1063,
      "NC2CCCC2": 1064,
      "NC2CC2": 1065,
      "NC3CCCCC3": 1066,
      "-])=": 1067,
      "cc2cc": 1068,
      "Cc1cccs1": 1069,
      "c5ccccc45": 1070,
      "NC1CC": 1071,
      "cs3": 1072,
      "c2ccccc2N": 1073,
      "Nc1s": 1074,
      "n4ccc": 1075,
      "c3nc4cc": 1076,
      "cc4F": 1077,
      "cc1N": 1078,
      "CCCc1c": 1079,
      "c3O": 1080,
      "c4n3": 1081,
      "nc2nc": 1082,
      "Cn3c": 1083,
      "nc2N": 1084,
      "c1ccccc1OC": 1085,
      "c4ncc": 1086,
      "N12": 1087,
      "c4C": 1088,
      "Oc4ccccc4": 1089,
      "CCOc1cccc": 1090,
      "nc2n": 1091,
      "sc2n1": 1092,
      "1CCC2": 1093,
      "c2ccccc2OC": 1094,
      "Cc2ccc3ccccc3c2": 1095,
      "NC3CC3": 1096,
      "sc3c2": 1097,
      "CCCCCCN": 1098,
      "C2CN": 1099,
      "N1CC2": 1100,
      "c1cccc2c": 1101,
      "n1nn": 1102,
      "c1nc2ccccc2s1": 1103,
      "CCc3ccc": 1104,
      "c4cccs4": 1105,
      "n4cnc5c": 1106,
      "CCOC2": 1107,
      "NCC1CCC": 1108,
      "CCCCCC1": 1109,
      "ccn": 1110,
      "Cc1ccco1": 1111,
      "Nc3ncc": 1112,
      "-][": 1113,
      "CNC2": 1114,
      "CCc1cc2c": 1115,
      "n1CC": 1116,
      "Nc4cccc": 1117,
      "ncc1C": 1118,
      ")\\": 1119,
      "Nc1cccnc1": 1120,
      "nc54": 1121,
      "1COC": 1122,
      "Cc1ccccc1NC": 1123,
      "2H": 1124,
      "N2CCNCC2": 1125,
      "Se": 1126,
      "nc1O": 1127,
      "n2CC": 1128,
      "CCCCOc1ccc": 1129,
      "COc1cc2nc": 1130,
      "CN1CCCC1": 1131,
      "Cn1cncn1": 1132,
      "4CCOCC4": 1133,
      "c3Cl": 1134,
      "cc4c": 1135,
      "c2OC": 1136,
      "CNc2nc": 1137,
      "nc3C": 1138,
      "COc1ncc": 1139,
      "CO3": 1140,
      "oc3cc": 1141,
      "CCN2CCN": 1142,
      "nn1C": 1143,
      "oc2ccc": 1144,
      "Nc1nccs1": 1145,
      "sc12": 1146,
      "34C": 1147,
      "NCc2ccco2": 1148,
      "Cc2cn": 1149,
      "CCCCCCCCCCCCCC": 1150,
      "CCO1": 1151,
      "CN3C": 1152,
      "c1cnccn1": 1153,
      "Nc1nc2ccc": 1154,
      "1CC2": 1155,
      "OCCCCC": 1156,
      "32C": 1157,
      "OCCN3": 1158,
      "Nc3ccc4c": 1159,
      "NCCc2ccc": 1160,
      "COc1ccc2nc": 1161,
      "c3ccccc3OC": 1162,
      "COc1ccc2cc": 1163,
      "n1ccc": 1164,
      "3CO": 1165,
      "NCc2cccc": 1166,
      "c1ccsc1": 1167,
      "N4CCCCC4": 1168,
      "C2C1": 1169,
      "CCCCCC2": 1170,
      "Cc1ccc2": 1171,
      "nc4ccccc4": 1172,
      "c3ncccn3": 1173,
      "Fc1cccc": 1174,
      "OC2CCN": 1175,
      "CCCc1ccc": 1176,
      "c2ccc3ncc": 1177,
      "CN1CCOCC1": 1178,
      "CCc1n": 1179,
      "N1CCCN": 1180,
      "c1OCC": 1181,
      "NCCc1c": 1182,
      "no3": 1183,
      "1cccc": 1184,
      "ccc4c3": 1185,
      "Nc1cc2": 1186,
      "NCCOCCO": 1187,
      "14": 1188,
      "Clc1cccc": 1189,
      "CSc2nc": 1190,
      "Cc1ccnc": 1191,
      "cnc12": 1192,
      "C1CC2": 1193,
      "c1cnc2c": 1194,
      "c2nc3ccccc3c": 1195,
      "CCCO3": 1196,
      "cn12": 1197,
      "N5CCN": 1198,
      "c2N": 1199,
      "c1Br": 1200,
      "NCCCCN": 1201,
      "CN2CCCC2": 1202,
      "c1oc": 1203,
      "cn2C": 1204,
      "c2cs": 1205,
      "CNc1ccc": 1206,
      "12O": 1207,
      "2c3cc4c": 1208,
      "ccc43": 1209,
      "Cn2nc": 1210,
      "cc1OCCC": 1211,
      "N1Cc1ccccc1": 1212,
      "nnc3": 1213,
      "NCCc2ccccc2": 1214,
      "N1S": 1215,
      "nn2C": 1216,
      "n6": 1217,
      "oc3c2": 1218,
      "Cc1oc": 1219,
      "nccc": 1220,
      "N1Cc1ccc": 1221,
      "c8": 1222,
      "C1c2ccccc2": 1223,
      "CCCc1ccccc1": 1224,
      "c2nccs2": 1225,
      "c2cccc3c": 1226,
      "N2CCCCCC2": 1227,
      "OCOC": 1228,
      "CCn1nc": 1229,
      "Cn1ccc": 1230,
      "3N": 1231,
      "CCCN1CCN": 1232,
      "COc2cc": 1233,
      "c3csc": 1234,
      "Nc1nc2ccccc2": 1235,
      "cccnc12": 1236,
      "c3ncccc3": 1237,
      "CCc2c": 1238,
      "oc2ccccc12": 1239,
      "CCO3": 1240,
      "23O": 1241,
      "n1cnc2c": 1242,
      "CN3CCOCC3": 1243,
      "C12CC3CC": 1244,
      "CN5": 1245,
      "Cc2nc": 1246,
      "CCNCC2": 1247,
      "CCOc2ccc": 1248,
      "COc1n": 1249,
      "nnn2": 1250,
      "CC1CCCC": 1251,
      "2COC": 1252,
      "c3c4c": 1253,
      "c1ccccc1S": 1254,
      "Cc2cccs2": 1255,
      "cccc3C": 1256,
      "c3ccsc3": 1257,
      "CCN1CCOCC1": 1258,
      "11": 1259,
      "c3nc4c": 1260,
      "CSC2": 1261,
      "CCNCC3": 1262,
      "nc2ccccc2c1": 1263,
      "CN2CCCCC2": 1264,
      "CN1CCC2": 1265,
      "2c2ccc": 1266,
      "OCc2cc": 1267,
      "nc4c3": 1268,
      "C1CCCC": 1269,
      "3CCCC": 1270,
      "nnn1": 1271,
      "NCC1CCCO1": 1272,
      "C2C3": 1273,
      "c3c2C": 1274,
      "N2CC3": 1275,
      "NCCCNC": 1276,
      "cccc2F": 1277,
      "OCCN2": 1278,
      "c1coc": 1279,
      "NC1CCC": 1280,
      "n4C": 1281,
      "c3ccoc3": 1282,
      "nn3C": 1283,
      "c3ccccc3S": 1284,
      "CNc2ccc": 1285,
      "Cc1ccncc1": 1286,
      "Sc2ccccc2": 1287,
      "C21": 1288,
      "Oc2ccc3c": 1289,
      "CCc1nnc": 1290,
      "CCN3C": 1291,
      "C2CCC2": 1292,
      "CSC1": 1293,
      "sc2nc": 1294,
      "C1CCC2": 1295,
      "OCCOC": 1296,
      "CNc1cc": 1297,
      "nc2s1": 1298,
      "nc2sc": 1299,
      "cc2NC": 1300,
      "c2nnnn2": 1301,
      "CCCCCCNC": 1302,
      "CN1CCCCC1": 1303,
      "1CSSC": 1304,
      "3NC": 1305,
      "c2ccccc23": 1306,
      "ccc1N": 1307,
      "nc4ccc": 1308,
      "n3cnc4c": 1309,
      "Oc2nc": 1310,
      "OCc2cccc": 1311,
      "1Cc2ccccc2": 1312,
      "CCCCCCCCCCCCCCC": 1313,
      "C23CC4CC": 1314,
      "c4nn": 1315,
      "CCCCCCCCCCCCC": 1316,
      "4CCN": 1317,
      "cccc5": 1318,
      "ccccc4n3": 1319,
      "CCC1CC2": 1320,
      "c2cnccn2": 1321,
      "c2cnc3": 1322,
      "2O1": 1323,
      "cc43": 1324,
      "Nc1sc2c": 1325,
      "c1cnn2": 1326,
      "C3CCC3": 1327,
      "c2ccn": 1328,
      "Cc4c": 1329,
      "c3ccccc3O": 1330,
      "ccc2O1": 1331,
      "NC1C": 1332,
      "CCCCC5": 1333,
      "c2cccc3c2": 1334,
      "N5CCOCC5": 1335,
      "oc4": 1336,
      "NC4CC4": 1337,
      "Nc2ccc3": 1338,
      "NCc1ccc2c": 1339,
      "Cc2ccccc2Cl": 1340,
      "Cc5ccccc5": 1341,
      "C4CCCCC4": 1342,
      "Nc1ccccc1Cl": 1343,
      "Cc2n": 1344,
      "cccc2c1": 1345,
      "Cc1onc": 1346,
      "CCCCCN": 1347,
      "c1cc2cccc": 1348,
      "cc3s2": 1349,
      "c2ncccc2c1": 1350,
      "C1CCS": 1351,
      "C1CCC1": 1352,
      "c2c1cc1": 1353,
      "CC6": 1354,
      "co2": 1355,
      "SCc2ccc": 1356,
      "COC3": 1357,
      "c4cc5": 1358,
      "NCc1cccnc1": 1359,
      "NCc2cc": 1360,
      "c3ccccc31": 1361,
      "Cc1cccc2ccccc12": 1362,
      "1CCCN": 1363,
      "Sc1ccc": 1364,
      "CCCCc1ccc": 1365,
      "NCCCO": 1366,
      "Cc2ccccc2F": 1367,
      "N2CCCN": 1368,
      "c1nc2ccccc2c": 1369,
      "NCCCCCCCC": 1370,
      "cc1NS": 1371,
      "NN2C": 1372,
      "on3": 1373,
      "CCc3c": 1374,
      "COCCn1c": 1375,
      "S3": 1376,
      "ccn3": 1377,
      "c4nc5ccccc5": 1378,
      "1ccc": 1379,
      "cnc3": 1380,
      "c2ccccc2c": 1381,
      "CCNC3": 1382,
      "C1c1ccccc1": 1383,
      "c3noc": 1384,
      "c1nccs1": 1385,
      "Oc3c": 1386,
      "COc1cc2ncnc": 1387,
      "ccccc32": 1388,
      "NC3CCN": 1389,
      "Cc1cnn": 1390,
      "ccc2o1": 1391,
      "C1Nc2ccc": 1392,
      "CN1CCCC": 1393,
      "c2ccc3ccccc3n2": 1394,
      "ncnc43": 1395,
      "c1ccc2oc": 1396,
      "c2cccnc21": 1397,
      "NCCN1CCOCC1": 1398,
      "Nc1cc2c": 1399,
      "CCN2CCC": 1400,
      "Cn1nn": 1401,
      "CCCCS": 1402,
      "Cn1cnc": 1403,
      "23CC": 1404,
      "Nc5ccc": 1405,
      "noc2C": 1406,
      "CCc2cc": 1407,
      "oc1C": 1408,
      "ccc2C1": 1409,
      "c3o": 1410,
      "Cc1ccsc1": 1411,
      "C2N": 1412,
      "4CCCC4": 1413,
      "CCN1CCCC1": 1414,
      "CCCc2ccccc2": 1415,
      "Nc1ccccn1": 1416,
      "ns": 1417,
      "ccc3cc": 1418,
      "n2cccc2": 1419,
      "CC5CC": 1420,
      "13C": 1421,
      "Cc1ccccn1": 1422,
      "CCCNC1": 1423,
      "c4cc5c": 1424,
      "N2S": 1425,
      "N1CCc2cc": 1426,
      "c3sc": 1427,
      "c1ccccc1Br": 1428,
      "N4CC": 1429,
      "CCn2c": 1430,
      "cc13": 1431,
      "Nc3ccccc3C": 1432,
      "C2OC": 1433,
      "cc3O": 1434,
      "c2cc3nc": 1435,
      "N1CCCCCC1": 1436,
      "c2c1cc1n": 1437,
      "CCc1nn": 1438,
      "cn23": 1439,
      "8O": 1440,
      "n2ncc3": 1441,
      "Cc1sc": 1442,
      "c2cc3ccc": 1443,
      "cc2nc": 1444,
      "c2ccnc3cc": 1445,
      "Nc2nccs2": 1446,
      "N2N": 1447,
      "CCCNC2": 1448,
      "+]=": 1449,
      "sc2c": 1450,
      "ncc2c1": 1451,
      "Nc1ccn": 1452,
      "c3nc4ccccc4s3": 1453,
      "C4CC": 1454,
      "NCCCCCC": 1455,
      "CN3CCCC3": 1456,
      "CBr": 1457,
      "CC2CCC": 1458,
      "Nc1ccccc1F": 1459,
      "NCc3cccc": 1460,
      "c6cc": 1461,
      "OCc2c1cc1n": 1462,
      "cc4c3": 1463,
      "nc3ccccc3c2": 1464,
      "cc2o1": 1465,
      "3COP": 1466,
      "c4ccccc4F": 1467,
      "Oc3cccc": 1468,
      "CCOC3": 1469,
      "NC12CC3CC": 1470,
      "CCOc1ccc2c": 1471,
      "NCCc3ccc": 1472,
      "Nc3n": 1473,
      "Oc1nc": 1474,
      "SS": 1475,
      "c2cc1C": 1476,
      "CN3CCCCC3": 1477,
      "NCC2CCCO2": 1478,
      "CSCCC": 1479,
      "c43": 1480,
      "ncc12": 1481,
      "n3ncc": 1482,
      "Nc1nc2cc": 1483,
      "Cn2cnc3c": 1484,
      "c1ccoc1": 1485,
      "N2CCc3c": 1486,
      "Cn1cnc2c": 1487,
      "Cn2ccnc2": 1488,
      "COc1cccc2c1C": 1489,
      "Cn1ncc": 1490,
      "CN2CCCC": 1491,
      "OCCNC": 1492,
      "ncc2c": 1493,
      "ccnc2": 1494,
      "c3ncnc4": 1495,
      "cc2c1O": 1496,
      "C2NC": 1497,
      "OCC4": 1498,
      "3CCC4": 1499,
      "cc4Cl": 1500,
      "CCCCCC3": 1501,
      "n1cnc": 1502,
      "ccc45": 1503,
      "c2sc3c": 1504,
      "CCC1C": 1505,
      "CCCN1CCC": 1506,
      "co1": 1507,
      "ccc3F": 1508,
      "N1CCNCC1": 1509,
      "NO1": 1510,
      "c3nnn": 1511,
      "nn3c2": 1512,
      "c1cccc2c1": 1513,
      "c2ccc3ccc": 1514,
      "COc1ccccc1CNC": 1515,
      "C1c2c": 1516,
      "C4CCN": 1517,
      "2CSSC": 1518,
      "NCc3ccco3": 1519,
      "N1c1ccccc1": 1520,
      "-]=[": 1521,
      "nnc12": 1522,
      "Cc3ccc4c": 1523,
      "cccnc23": 1524,
      "CNCCC": 1525,
      "scc": 1526,
      "NC3CCCC3": 1527,
      "CCN2CCOCC2": 1528,
      "n4nc": 1529,
      "n2cccn2": 1530,
      "ncc5": 1531,
      "c2cn1": 1532,
      "4OC": 1533,
      "5OC": 1534,
      "Cc2ccccn2": 1535,
      "ccc3Cl": 1536,
      "C3O": 1537,
      "ccc1Oc1ccc": 1538,
      "CCOCCOCCO": 1539,
      "sc3n2": 1540,
      "c1cn2c": 1541,
      "C5CC5": 1542,
      "c1nnnn1": 1543,
      "Cc3cccnc3": 1544,
      "COc2cccc": 1545,
      ")(/": 1546,
      "NC5": 1547,
      "Nc2ncnc3": 1548,
      "c3cc4cc": 1549,
      "Cc4cccc": 1550,
      "c1c2cc": 1551,
      "c3ccc4ccccc4n3": 1552,
      "Nn1c": 1553,
      "ccc3o2": 1554,
      "CCCOc1cc": 1555,
      "2CNC": 1556,
      "CCCc1nc": 1557,
      "Cc2ccccc2C": 1558,
      "Nc2ccccn2": 1559,
      "Cc1nc2cc": 1560,
      "Nc2ccccc21": 1561,
      "cccc34": 1562,
      "c4O": 1563,
      "c2cnc3c": 1564,
      "C2CCCC": 1565,
      "1c": 1566,
      "7C": 1567,
      "cn3C": 1568,
      "3C4": 1569,
      "c3nc4ccc": 1570,
      "cc2c1C": 1571,
      "c2cncnc2": 1572,
      "c4ccccc4Cl": 1573,
      "cccc32": 1574,
      "CCCN1": 1575,
      "N3CCCCCC3": 1576,
      "CC3CCCCC3": 1577,
      "ccc5c4": 1578,
      "cnc1C": 1579,
      "NCc4ccc": 1580,
      "C1c1cccc": 1581,
      "Cn3cc": 1582,
      "45C": 1583,
      "c3s2": 1584,
      "CC1C3": 1585,
      "nc2c1C": 1586,
      "c4nccc": 1587,
      "Brc1ccc": 1588,
      "Nc1ccc2": 1589,
      "c1cnc2ccc": 1590,
      "ccc3OC": 1591,
      "Nc3ccc4": 1592,
      "CCOc1c": 1593,
      "sc2ccccc12": 1594,
      "CS2": 1595,
      "c3nccs3": 1596,
      "CN2CCC3": 1597,
      "c4cncc": 1598,
      "NN1C": 1599,
      "cc3cc": 1600,
      "Sc1nc": 1601,
      "-].": 1602,
      "CCN1CCCCC1": 1603,
      "c3ccccc3N": 1604,
      "Nc2nc3ccccc3": 1605,
      "NCc1ccccn1": 1606,
      "cc2N1": 1607,
      "n3cccn3": 1608,
      "c1cc2ccc": 1609,
      "c2s1": 1610,
      "NCc2cccnc2": 1611,
      "c3c1O": 1612,
      "cc1C2": 1613,
      "c1ccnc2cc": 1614,
      "ccc3O": 1615,
      "n21": 1616,
      "Cc1nc2ccc": 1617,
      "Nc2c3ccccc3": 1618,
      "n2c3c": 1619,
      "nnc1SCC": 1620,
      "c3OC": 1621,
      "Sc3ccc": 1622,
      "COc1cc2cc": 1623,
      "N2c2ccc": 1624,
      "OC1C": 1625,
      "c1ncccn1": 1626,
      "Clc1ccc2c": 1627,
      "CN1CCCN": 1628,
      "N4CCNCC4": 1629,
      "c4ccccc4c3": 1630,
      "nc2sc3c": 1631,
      "c3ccccc3n": 1632,
      "CC4CC4": 1633,
      "Oc1ccc2": 1634,
      "CCNCC": 1635,
      "oc2C": 1636,
      "ccc2ccccc12": 1637,
      "c2ccccc2c1C": 1638,
      "COCc1ccccc1": 1639,
      "c2c1c": 1640,
      "C3CCOCC3": 1641,
      "Nc1cnc": 1642,
      "4CCCCC4": 1643,
      "c2ccccc2c2cc": 1644,
      "1Cc2c": 1645,
      "cc4C": 1646,
      "CC1CCCN": 1647,
      "4CCCN": 1648,
      "18": 1649,
      "ncc23": 1650,
      "cc4CC": 1651,
      "c2ccccc2Br": 1652,
      "N1CCc2ccccc2C1": 1653,
      "c3no": 1654,
      "OCCCO": 1655,
      "C1Nc2ccccc2": 1656,
      "Nc2cccnc2": 1657,
      "Nc1ccncc1": 1658,
      "CNCC2": 1659,
      "se": 1660,
      "cnc23": 1661,
      "ccnc2c1": 1662,
      "Cc3ccco3": 1663,
      "oc23": 1664,
      "nc3ccccc13": 1665,
      "Clc1ccccc1": 1666,
      "C2CC3": 1667,
      "Cc1ccccc1Cl": 1668,
      "c2cnc3ccc": 1669,
      "4CC5CC": 1670,
      "Cc1ccccc1F": 1671,
      "CCCCc1nc": 1672,
      "NCCc3ccccc3": 1673,
      "nc4ccccc34": 1674,
      "CN3CC": 1675,
      "c3ccccc3c": 1676,
      "ccc2N": 1677,
      "Cc5ccc": 1678,
      "c2cccc3cccc": 1679,
      "-](": 1680,
      "Nc1cn": 1681,
      "c2cc1": 1682,
      "c2coc": 1683,
      "C1CCOCC1": 1684,
      "3ccccc3": 1685,
      "ccc2cc": 1686,
      "n2Cc2ccc": 1687,
      "OCc1cc": 1688,
      "Sc1nnc": 1689,
      "Cn1c2c": 1690,
      "N2CCc3ccccc3C2": 1691,
      "C2CCNCC2": 1692,
      "CS1": 1693,
      "NCc2ccc3c": 1694,
      "65": 1695,
      "c4nnc": 1696,
      "C2CCOCC2": 1697,
      "Nc1ccc2nc": 1698,
      "cccc4F": 1699,
      "C2CCCN2C": 1700,
      "23OO4": 1701,
      "nc2cnc": 1702,
      "COCCC": 1703,
      "c2cn3c": 1704,
      "SCCN": 1705,
      "cnn": 1706,
      "CN2CCC1CC2": 1707,
      "cc2N": 1708,
      "CSc2n": 1709,
      "12CCN": 1710,
      "CSc2ccc": 1711,
      "2c2ccccc2": 1712,
      "(=[": 1713,
      "CCCc3ccccc3": 1714,
      "CCCN2C": 1715,
      "n2cncn2": 1716,
      "Cc1cc2nc": 1717,
      "NCc1c": 1718,
      "c2ccoc2": 1719,
      "CCCCC1C": 1720,
      "Cc2ccncc2": 1721,
      "Fc1ccccc1": 1722,
      "c2c1cc": 1723,
      "CNC3": 1724,
      "2c3cc": 1725,
      "Cc1ccc2oc": 1726,
      "nccc12": 1727,
      "ccc2n": 1728,
      "nc4ccccc43": 1729,
      "c24": 1730,
      "C1S": 1731,
      "NCc1cccs1": 1732,
      "CCCn1": 1733,
      "Cc3ccccc3F": 1734,
      "nc3n": 1735,
      "sc4": 1736,
      "OCc3cccc": 1737,
      "CSc1ccccc1": 1738,
      "ccc2N1": 1739,
      "N6": 1740,
      "c2ccccc2C3": 1741,
      "c1CCC": 1742,
      "COc2ccc3c": 1743,
      "N21": 1744,
      "Cc1cc2cc": 1745,
      "c4ccnc": 1746,
      "c1cc2ccccc2o1": 1747,
      "OCc3c": 1748,
      "CC12": 1749,
      "SCc3ccc": 1750,
      "c1ccc2ccccc2n1": 1751,
      "c1cc2nc": 1752,
      "CCCCCCCCCCCCCCCCCC": 1753,
      "C2CC3CC": 1754,
      "N3CCC4": 1755,
      "OCC2CC2": 1756,
      "Cc2nnc": 1757,
      "Nc2ccccc2Cl": 1758,
      "ccccc5c4": 1759,
      "c3cnccn3": 1760,
      "N1Cc2ccccc2C": 1761,
      "N1CCS": 1762,
      "C7": 1763,
      "cnc2c1": 1764,
      "cc2cccc": 1765,
      "COCc2ccccc2": 1766,
      "ncnc3": 1767,
      "nc3nc": 1768,
      "CCN2CC": 1769,
      "c5ccccc54": 1770,
      "cc3o2": 1771,
      "Cn2ccc": 1772,
      "CCNCC1": 1773,
      "CC2CC": 1774,
      "Cc1cncc": 1775,
      "c2cc3ccccc3o2": 1776,
      "c3c4ccccc4": 1777,
      "nc2O": 1778,
      "6c": 1779,
      "CC1CCCO1": 1780,
      "Cc3ccc4": 1781,
      "CCC5": 1782,
      "1O2": 1783,
      "c2cccc3cccnc23": 1784,
      "c2ccccc2NC": 1785,
      "CCOc1ccccc1NC": 1786,
      "Cc2cccc3ccccc23": 1787,
      "cnc32": 1788,
      "CCCn1cc": 1789,
      "n2cccc": 1790,
      "c2nc3ccccc3o2": 1791,
      "Sc1ccccc1": 1792,
      "cn1C": 1793,
      "Nc1ncnc2c1c": 1794,
      "Nc1ccccc1NC": 1795,
      "CN4CCN": 1796,
      "3CCCN3C": 1797,
      "NCc4ccccc4": 1798,
      "ON": 1799,
      "#[": 1800,
      "n2n": 1801,
      "Cn1nnc": 1802,
      "2CN1C": 1803,
      "c1CN": 1804,
      "2CCCN2C1": 1805,
      "Nc3ccccc32": 1806,
      "CC1c1ccc": 1807,
      "c6c": 1808,
      "c3cccc4c3": 1809,
      "NCCCCNC": 1810,
      "C5C": 1811,
      "CCN3CCOCC3": 1812,
      "ccccc7": 1813,
      "nn2c": 1814,
      "COc2c": 1815,
      "1Cc1ccccc1": 1816,
      "C3CCNCC3": 1817,
      "c3ncn": 1818,
      "Nc2nc3c": 1819,
      "NCCN2CCOCC2": 1820,
      "3c4ccc": 1821,
      "c2nn3c": 1822,
      "NNS": 1823,
      "c2O1": 1824,
      "C12CCN": 1825,
      "c1cc3c": 1826,
      "CCCNC3": 1827,
      "6OC": 1828,
      "c2ccccn12": 1829,
      "n3ccccc3": 1830,
      "Sc3ccccc3": 1831,
      "oc3c": 1832,
      "c1no": 1833,
      "c2cnn3c": 1834,
      "Nc1cccc2ccccc12": 1835,
      "2ccc": 1836,
      "COCCOC": 1837,
      "c1ncccc1C": 1838,
      "SCc2ccccc2": 1839,
      "ccc13": 1840,
      "5CCCN": 1841,
      "cnc21": 1842,
      "cc2Br": 1843,
      "C4CCCC4": 1844,
      "n2Cc2ccccc2": 1845,
      "CC2CCN": 1846,
      "cc1Nc1nc": 1847,
      "n5c": 1848,
      "C1CSC": 1849,
      "Cc2csc": 1850,
      "4CN": 1851,
      "CCNc1cc": 1852,
      "CON": 1853,
      "Cn2nn": 1854,
      "Cc1ccc2cc": 1855,
      "CN4CCOCC4": 1856,
      "COC4": 1857,
      "C2c2ccc": 1858,
      "c4ccoc4": 1859,
      "3CNC": 1860,
      "COCc1cc": 1861,
      "C1CCNCC1": 1862,
      "COCCCNC": 1863,
      "cc45": 1864,
      "ccc3ccccc23": 1865,
      "cccc1NC": 1866,
      "CCSc1nnc": 1867,
      "o5": 1868,
      "1CCc2c": 1869,
      "c2c1O": 1870,
      "CCCCCCCN": 1871,
      "1CCCC1": 1872,
      "-]#[": 1873,
      "CCNC1": 1874,
      "OC5": 1875,
      "c9": 1876,
      "CO4": 1877,
      "sc23": 1878,
      "CCc4ccccc4": 1879,
      "ncc2C": 1880,
      "Cc1c2c": 1881,
      "c5cccnc5": 1882,
      "C1CCCN1C": 1883,
      "nc1S": 1884,
      "Nc2cn": 1885,
      "COc1cnc": 1886,
      "c2ncccc2C": 1887,
      "CCCCCOC": 1888,
      "c2ncccc12": 1889,
      "CSc1cccc": 1890,
      "2Cc3c": 1891,
      "NCCCN1CCOCC1": 1892,
      "c2cccnc12": 1893,
      "CCF": 1894,
      "ccc3C2": 1895,
      "c3ncccc23": 1896,
      "1c1ncc": 1897,
      "n3cccc3": 1898,
      "nn2c1": 1899,
      "CCCCC2C": 1900,
      "OCc2cn": 1901,
      "12CO": 1902,
      "ncc2Cl": 1903,
      "Cc3cnc": 1904,
      "sc4c": 1905,
      "NCCC1": 1906,
      "CCN1CCCC": 1907,
      "ccc2s1": 1908,
      "ccc1S": 1909,
      "c2cnn3": 1910,
      "Cn1n": 1911,
      "c5ccncc5": 1912,
      "cnn3": 1913,
      "-])([": 1914,
      "Fc1cc": 1915,
      "N2CCS": 1916,
      "c3ccccn23": 1917,
      "nnn3": 1918,
      "NCc1ccccc1Cl": 1919,
      "ncccc3": 1920,
      "C23": 1921,
      "c45": 1922,
      "sc2C1": 1923,
      "n1cncn1": 1924,
      "1c1cccc": 1925,
      "45": 1926,
      "c1nc2ccccc2o1": 1927,
      "onc": 1928,
      "CNc2cc": 1929,
      "OO": 1930,
      "cc1CN": 1931,
      "COc2ccccc2O1": 1932,
      "CCNC4": 1933,
      "SSC": 1934,
      "C3C2": 1935,
      "c2nc3n": 1936,
      "nc3sc": 1937,
      "CCP": 1938,
      "CCC12": 1939,
      "COc1cccc2c": 1940,
      "CCC1C2": 1941,
      "cccnc34": 1942,
      "COCCN1C": 1943,
      "NC2CCC": 1944,
      "n4ccnc4": 1945,
      "Oc1cccc2": 1946,
      "occ": 1947,
      "OC2C": 1948,
      "NCC3CCCO3": 1949,
      "][": 1950,
      "C1Cc2ccccc2": 1951,
      "c2ns": 1952,
      "NCCc2c": 1953,
      "NCCN1C": 1954,
      "Nc3nccs3": 1955,
      "CCc3ccccc32": 1956,
      "ccc6": 1957,
      "cn2c": 1958,
      "c1CNC": 1959,
      "Nc1ncnc2": 1960,
      "c3cncnc3": 1961,
      "sc21": 1962,
      "CC3C": 1963,
      "c2nnc3n2": 1964,
      "c3ccc4nc": 1965,
      "n1ncc": 1966,
      "c1onc": 1967,
      "s5": 1968,
      "CCCCCc1ccc": 1969,
      "c4cnc5": 1970,
      "1C1": 1971,
      "Clc1cc": 1972,
      "1CCNC1": 1973,
      "c4nc5cc": 1974,
      "OCc3cc": 1975,
      "c1cs": 1976,
      "N3CCCN": 1977,
      "OCCF": 1978,
      "NCCC2": 1979,
      "Nc1c2c": 1980,
      "Cc3ccccn3": 1981,
      "1Cc1ccc": 1982,
      "c1ccc2c3c": 1983,
      "Cc1cccc2nc": 1984,
      "NCc1ccncc1": 1985,
      "N2CCOC": 1986,
      "N3CC4": 1987,
      "Oc1cc2c": 1988,
      "c1c2": 1989,
      "CCCOc2ccc": 1990,
      "c1ncccc1": 1991,
      "c2c1CN": 1992,
      "NC1c1ccc": 1993,
      "4C3": 1994,
      "ncccc4": 1995,
      "1N2C": 1996,
      "N5CCC": 1997,
      "CNc3ccc": 1998,
      "Cc2ccccc21": 1999,
      "Cc1nc2ccccc2": 2000,
      "Cc3cccs3": 2001,
      "CCO4": 2002,
      "Cn1c2ccccc2": 2003,
      "c2o1": 2004,
      "Nc2ccccc2F": 2005,
      "c2sccc2": 2006,
      "OCCCCCC": 2007,
      "sc4n3": 2008,
      "c3cccc4c": 2009,
      "CCC1CN": 2010,
      "C1c2cc": 2011,
      "c2ncn3": 2012,
      "Nc1cncc": 2013,
      "Cc4cc": 2014,
      "ncnc1": 2015,
      "CCc1nc2c": 2016,
      "ncnc54": 2017,
      "c3oc": 2018,
      "cc2c1OC": 2019,
      "1ccccc1": 2020,
      "CCCN2": 2021,
      "CC12CCC": 2022,
      "N1CCO": 2023,
      "Cc2cc3c": 2024,
      "O6": 2025,
      "c2ncccc21": 2026,
      "Cn3ccnc3": 2027,
      "c3cnc4": 2028,
      "n2cnc": 2029,
      "oc3ccc": 2030,
      "ccc1OCc1ccccc1": 2031,
      "sc2c1CCCC2": 2032,
      "n2nnnc2": 2033,
      "CCc1ccc2c": 2034,
      "NCc4cccc": 2035,
      "cc2n": 2036,
      "CN2CCCN": 2037,
      "n5cc": 2038,
      "NCc2c": 2039,
      "C1NCC": 2040,
      "CSC3": 2041,
      "ccc3nc2": 2042,
      "CCCNc1nc": 2043,
      "CCSc1nc": 2044,
      "OCCCNC": 2045,
      "2OCC": 2046,
      "CC1OC": 2047,
      "N1CCc2ccccc21": 2048,
      "5CCOCC5": 2049,
      "cccc1O": 2050,
      "5CCCN5C": 2051,
      "Cn3": 2052,
      "c2onc": 2053,
      "c1nccn1": 2054,
      "CCS2": 2055,
      "Nc3nccc": 2056,
      "ccc4n3": 2057,
      "cccc4Cl": 2058,
      "CC1CCCC1": 2059,
      "C2S": 2060,
      "Cc3ccncc3": 2061,
      "c4ncccn4": 2062,
      "CCCNS": 2063,
      "3Cc4ccc": 2064,
      "C12C": 2065,
      "c3nnnn3": 2066,
      "CNCCN": 2067,
      "c1ccccc1N": 2068,
      "OCc5ccccc5": 2069,
      "sc2C": 2070,
      "cc2O1": 2071,
      "CCOc2ccccc2": 2072,
      "nc2C1": 2073,
      "c2ccc3ncnc": 2074,
      "1c1cc": 2075,
      "CCCCCCCCc1ccc": 2076,
      "CCc1ncnc": 2077,
      "NCCN3CCOCC3": 2078,
      "CCOc1nc": 2079,
      "NN2": 2080,
      "OCc1cccc": 2081,
      "N1c1cccc": 2082,
      "2OP": 2083,
      "cc2oc1": 2084,
      "c1nn2c": 2085,
      "n2c1n": 2086,
      "cccc13": 2087,
      "OO1": 2088,
      "CCc2ccccc21": 2089,
      "N1CCc2nc": 2090,
      "cnc4": 2091,
      "cnc1N": 2092,
      "c1cncnc1": 2093,
      "cccc2C1": 2094,
      "NO2": 2095,
      "Oc3": 2096,
      "N1Cc2ccccc2C1": 2097,
      "c2ccccc2S1": 2098,
      "NC23CC4CC": 2099,
      "ccnc2cc1OCCC": 2100,
      "cc2S": 2101,
      "CCCCCO": 2102,
      "OCCN1CCN": 2103,
      "N2Cc3ccccc3C2": 2104,
      "SCc3ccccc3": 2105,
      "Cc1cccc2c": 2106,
      "Cn2cncn2": 2107,
      "NCCOC": 2108,
      "Cc1nccn1": 2109,
      "CCc1ccccc1NC": 2110,
      "nn5": 2111,
      "Cc1ccccc1S": 2112,
      "N3C2": 2113,
      "ccc3N": 2114,
      "N2CCc3ccccc32": 2115,
      "n2nccn2": 2116,
      "NCc2ccccn2": 2117,
      "cc1N1CCN": 2118,
      "n2nnc": 2119,
      "ncc3c2": 2120,
      "NCC4": 2121,
      "c2nccnc2": 2122,
      "CCOCCCNC": 2123,
      "NCCCN1CCN": 2124,
      "COc1ccc2nccc": 2125,
      "Cc1s": 2126,
      "CCN3CCC": 2127,
      "CC2CN": 2128,
      "ccc31": 2129,
      "Cc3ccccc3Cl": 2130,
      "c2cccc3cc": 2131,
      "cnc2N": 2132,
      "ncc1Cl": 2133,
      "CC2CCCC2": 2134,
      "NCCCCCCN": 2135,
      "c5ccccn5": 2136,
      "ccn12": 2137,
      "cnc2c": 2138,
      "OCc2c": 2139,
      "c6cccc": 2140,
      "c5cn": 2141,
      "CCN3CCN": 2142,
      "c2oc3c": 2143,
      "OCc4ccc": 2144,
      "c1cccc3": 2145,
      "CC2CCCO2": 2146,
      "NCCCc1ccccc1": 2147,
      "c3nc12": 2148,
      "COc1ccc2oc": 2149,
      "OCCCCCCCC": 2150,
      "4CCCC": 2151,
      "n2cnnc2": 2152,
      "CCc2cccc": 2153,
      "1CN2CC": 2154,
      "ncnc12": 2155,
      "Cc1ccccc1OCC": 2156,
      "cc3CC": 2157,
      "c2ccc3nnc": 2158,
      "NCCC3": 2159,
      "CSc1cc": 2160,
      "COc1cc2c3c": 2161,
      "Nc3ccccn3": 2162,
      "OCc3cn": 2163,
      "ncn4": 2164,
      "OCCO5": 2165,
      "noc1C": 2166,
      "c4nccs4": 2167,
      "OB": 2168,
      "COCC1": 2169,
      "n2cnnn2": 2170,
      "c1nc2ccccc2n1": 2171,
      "NCCCNCCCCN": 2172,
      "Nc1nc2ccccc2s1": 2173,
      "CCCCCn1c": 2174,
      "c1ccc3c": 2175,
      "2Cc3ccccc3": 2176,
      "Cn3cncn3": 2177,
      "NCc2cccs2": 2178,
      "CCOC4": 2179,
      "ccc1Br": 2180,
      "CCC2C": 2181,
      "Nc3cccnc3": 2182,
      "COc1ccccc1CN": 2183,
      "NCCCCCCNC": 2184,
      "NCC1CC1": 2185,
      "Cc5c": 2186,
      "Nc4c": 2187,
      "COCC2": 2188,
      "cccc2n1": 2189,
      "Nc2ccnc3cc": 2190,
      "C1CCc2c": 2191,
      "Oc1ccccc1C": 2192,
      "1c2ccccc2C": 2193,
      "2CC1": 2194,
      "Nc2ncc3c": 2195,
      "N5C": 2196,
      "N1c2ccccc2": 2197,
      "4CCCN4C": 2198,
      "1n1cc": 2199,
      "oc3C": 2200,
      "c2c1nc": 2201,
      "N32": 2202,
      "cn5": 2203,
      "OC1CCN": 2204,
      "cc1CNC": 2205,
      "nc3ccccc3": 2206,
      "onc1": 2207,
      "N2CCO": 2208,
      "Nc2cccc3ccccc23": 2209,
      "cc3c1": 2210,
      "CN1CC2": 2211,
      "c7ccccc7": 2212,
      "Nc2ncnc": 2213,
      "4N": 2214,
      "CC1CCC1": 2215,
      "n1cccn1": 2216,
      "ccc2n1C": 2217,
      "54": 2218,
      "NCc2ccncc2": 2219,
      "C1CCc2cc": 2220,
      ")=[": 2221,
      "Nc2nc3ccc": 2222,
      "c3ccc4cc": 2223,
      "cc1OC1CCCC1": 2224,
      "CC2C3": 2225,
      "c5nc": 2226,
      "ccc4C": 2227,
      "CCCCCS": 2228,
      "Cc1coc": 2229,
      "sc1NC": 2230,
      "COc1cccc2c1": 2231,
      "ns2": 2232,
      "NCc3cccnc3": 2233,
      "CCN2CCCCC2": 2234,
      "CCCCN1": 2235,
      "Cc1ccccc1OC": 2236,
      "Nc1ccnc": 2237,
      "C5CCCC5": 2238,
      "CCn1ccc": 2239,
      "Oc4cc": 2240,
      "n2CCC": 2241,
      "c3cn4nc": 2242,
      "OCCN3CCCCC3": 2243,
      "1ccn": 2244,
      "NN1": 2245,
      "NCCCN2CCOCC2": 2246,
      "NCC1CCN": 2247,
      "sc2cc": 2248,
      "c1c2ccc": 2249,
      "C2CCS": 2250,
      "ccc1N1CCOCC1": 2251,
      "cc4C3": 2252,
      "Oc3ccc4c": 2253,
      "Cn2nnc": 2254,
      "Cc1cc2cccc": 2255,
      "CC2C4": 2256,
      "C3CN": 2257,
      "ccc1Nc1ncc": 2258,
      "C3CCCC": 2259,
      "oc2c1C": 2260,
      "Cc2cc3ccccc3": 2261,
      "CCc1cnc": 2262,
      "cc1C1": 2263,
      "c4c5ccc": 2264,
      "c1sc2ccccc2c1": 2265,
      "ccccc24": 2266,
      "c5C": 2267,
      "c5nc6": 2268,
      "Nc1ncc2c": 2269,
      "CN1CCc2c": 2270,
      "OCC1OC": 2271,
      "n7": 2272,
      "nc2N1": 2273,
      "ccccc43": 2274,
      "Nc1ncnc": 2275,
      "CCOc1ccc2nc": 2276,
      "OCC4CC4": 2277,
      "SC3": 2278,
      "c4F": 2279,
      "nc5cc": 2280,
      "SCCO": 2281,
      "CCCN1CC": 2282,
      "2Cc3ccc": 2283,
      "c1nc2cccc": 2284,
      "Nc3cccc4": 2285,
      "2CCCN": 2286,
      "Nc3ccccc3N": 2287,
      "c2cn3ccc": 2288,
      "CCN1S": 2289,
      "Nc2ncnc3cc": 2290,
      "Nc3nnc": 2291,
      "2Cc2ccccc2": 2292,
      "c1cccc2c1C": 2293,
      "4NC": 2294,
      "CCCCCCCCNC": 2295,
      "C1Cc2c": 2296,
      "1SC": 2297,
      "cc1I": 2298,
      "COc1ccccc1N": 2299,
      "c2cnc3cc": 2300,
      "Nc2ccncc2": 2301,
      "Cc1cccc2cc": 2302,
      "c7ccc": 2303,
      "COc3ccccc3O2": 2304,
      "COc4ccc": 2305,
      "CCCCCCOc1ccc": 2306,
      "1CSC": 2307,
      "CCN6CC": 2308,
      "Nc5cc": 2309,
      "CCNc1ccc": 2310,
      "nc1SCC": 2311,
      "NCCCn1ccnc1": 2312,
      "1C3": 2313,
